[
    {
        "title": "Southwest Airlines In Settlement Talks With Activist Investor Elliott Management To Avoid Proxy Fight For Board Control: Report",
        "body": "Elliott Investment Management and Southwest Airlines (NYSE:LUV) have begun discussing a potential settlement that could avoid a proxy fight for control of the airline company’s board.\nWhat Happened: Elliott has proposed a plan that involves giving it representation on the airline’s board without control, Bloomberg reported on Saturday, citing people familiar with the matter.\nThe report added that the talks are progressing towards a resolution. However, they haven’t been finalized and could also be unsuccessful, it said.\nBenzinga has reached out to both Southwest and Elliott for confirmation but is yet to receive a response.\nWhy It Matters: Earlier this week, Elliott Investment Management asked for a special meeting of Southwest shareholders for Dec. 10 and submitted a proposal to replace eight directors on the struggling airline's board. \nElliott has made several attempts to persuade Southwest to implement what it sees as \"necessary\" governance changes to improve financial performance since June. The hedge fund said it currently maintains nearly 11% stake in the airline.\n\"We are taking this step today because the need for improved oversight at Southwest has never been more urgent,\" the activist investor said earlier this week while adding that the company needs an experienced and qualified Board to oversee changes.\nHowever, Southwest then termed the special meeting request as “unnecessary and inappropriate” and termed the hedge fund’s demands as “extreme.”\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead More:\n\nElon Musk, Tesla Refute Inefficiency Concerns With Wireless Charging On Cybercab: ‘There Is No Meaningful Efficiency Difference…’\n\nPhoto via Wikimedia Commons",
        "date": "2024-10-20",
        "time": "00:17:42",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417317/southwest-airlines-in-settlement-talks-with-activist-investor-elliott-management-to-avoid-proxy-figh"
    },
    {
        "title": "Nvidia Stock Is Up Over 233% In The Past Year And Tech Bulls Say It Could Go Even Higher From Here: '…You'll See The Stock Double Over The Next Several Years'",
        "body": "Nvidia Corp (NASDAQ:NVDA) shares closed up 0.8% at $138 on Friday, taking its market capitalization to over $3 trillion, but the stock can go higher, according to bullish experts. \nExpert Commentary: Ram Ahluwalia, CEO of Lumida Wealth Management is reportedly optimistic about the company touching a $4 trillion valuation.\n“There’s no question about it. The demand for GPU chips is strong, and you’re seeing early adopters starting to get some ROI,” Ahulwali told Yahoo Finance. \nT. Rowe Price portfolio manager Tony Wang also reportedly shares the confidence.\n\"You’ve got several more years of AI investment before you hit saturation or a more maturing AI landscape,\" according to Dan Niles, founder of Niles Investment Management. \"You’ll see Nvidia’s revenues double over the next several years, and I think you’ll see the stock double over the next several years,” Niles told Yahoo Finance. \n“…demand for Inference compute could grow exponentially as model builders (such as OpenAI) solve for high throughput and low latency. Importantly, supported by its full-stack approach, we believe Nvidia is well-positioned to capture this growth opportunity in Inference,” according to Goldman Sachs, as reported by the Financial Times. Sachs has a price target of $150 for the stock. \nBofa Securities on Friday maintained their ‘Buy’ rating on the stock and increased its price target for the company from $165 to $190. \nIn fact, Nvidia has a consensus price target of $234.49 based on the ratings of 38 analysts. \nWhy It Matters: Nvidia stock is up by nearly 186.5% year-to-date, according to data from Benzinga Pro. The company now has a market cap of about $3.39 trillion.  \n\nAs of its current valuation, Apple is the only American company with a market cap higher than Nvidia. However, even Apple’s valuation is short of $4 trillion ($3.57 trillion). \n\nNvidia stock has surged more than 233% over the past year, with its share price jumping from $41 to $138. Meanwhile, ETFs tracking Nvidia, such as GraniteShares 2x Long NVDA Daily ETF (NASDAQ:NVDL) and Direxion Daily NVDA Bull 2X Shares (NASDAQ:NVDU), have delivered gains of at least 440% during the same period.\nRead More:\n\nElon Musk, Tesla Refute Inefficiency Concerns With Wireless Charging On Cybercab: ‘There Is No Meaningful Efficiency Difference…’\n\nImage Via Shutterstock",
        "date": "2024-10-20",
        "time": "01:22:24",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/10/41417379/nvidia-stock-is-up-over-233-in-the-past-year-and-tech-bulls-say-it-could-go-even-hi"
    },
    {
        "title": "Nvidia, Google And Microsoft To Present AI Tools Aimed At Reducing Healthcare Worker Burnout At Las Vegas Conference",
        "body": "Leading tech firms, including Nvidia Corporation (NASDAQ:NVDA), Alphabet Inc‘s Google (NASDAQ:GOOGL) (NASDAQ:GOOG), and Microsoft Corporation (NASDAQ:MSFT), are preparing to showcase their artificial intelligence (AI) tools at the forthcoming HLTH healthcare technology conference in Las Vegas.\nWhat Happened: The conference, set to kick off on Sunday, is anticipated to draw over 12,000 industry leaders, CNBC reported. The tech giants aim to demonstrate how their AI solutions can help reduce the administrative load on healthcare professionals, thereby freeing up crucial time.\nHealthcare workers are currently grappling with excessive documentation, a major factor leading to industry burnout and a predicted shortfall of 100,000 healthcare workers by 2028, according to consulting firm Mercer. Tech companies are confident that their AI tools can help mitigate this problem.\nSee Also: Warren Buffett Says He Wouldn’t Be Successful Today If He Didn’t Take This $100 College Class\nGoogle, on Thursday, announced the general availability of Vertex AI Search for Healthcare, a tool that enables developers to build applications to assist doctors in swiftly searching for information across various medical records. Google also published survey results showing that clinicians spend nearly 28 hours a week on administrative tasks, with 80% of providers asserting that this work takes away from patient care time.\nWhy It Matters: The healthcare industry has been increasingly turning to AI to address its challenges. Google, for example, has been using AI to detect illnesses through sound, such as coughs and sneezes, with its Health Acoustic Representations (HeAR) model.\nEarlier this month, Microsoft unveiled its suite of tools designed to lessen clinicians’ administrative workload. These tools, most of which are still under development, include medical imaging models, a healthcare agent service, and an automated documentation solution for nurses.\nAI scribe tools such as DAX Copilot, provided by Microsoft’s subsidiary Nuance Communications, have seen a surge in popularity this year. These tools employ AI to transcribe doctors’ interactions with patients into clinical notes and summaries, reducing the need for doctors to manually record these notes.\nNvidia is also gearing up to address the workload of doctors and nurses at the HLTH conference. Kimberly Powell, Nvidia’s vice president of healthcare, will give a keynote on Monday detailing how generative AI can assist healthcare professionals in devoting more time to patient care.\nRead Next: Elon Musk Says SpaceX’s Next-Generation Starlink Satellites Will Be ‘So Big That Only Starship Can Launch’\nPhoto: PeopleImages.com – Yuri A/Shutterstock",
        "date": "2024-10-20",
        "time": "01:50:32",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/markets/equities/24/10/41417401/nvidia-google-and-microsoft-to-present-ai-tools-aimed-at-reducing-healthcare-worker-burnout-at-l"
    },
    {
        "title": "Peter Schiff Criticizes Trump's Tariff Strategy, Oil Prices Drop Following Netanyahu's Statement, Kamala Harris Pledges To Remove Unnecessary Degree Requirements And More: Top Political Updates This Week",
        "body": "The past week was a hotbed of activity, with political debates and economic strategies taking center stage. From tariff discussions to election battles, the week saw a flurry of statements and counterarguments from prominent figures. Here’s a quick recap of the top stories that made headlines over the weekend.\nPeter Schiff Criticizes Trump’s Tariff Strategy\nNoted economist and financial commentator Peter Schiff voiced his opinion on former President Donald Trump’s tariff strategy. Schiff, in a recent social media post, argued that Trump’s tariffs were not imposed on China but on Americans purchasing Chinese products. Read the full article here.\nBarry Diller Criticizes Billionaire Trump Supporters\nBarry Diller, the chair of IAC Inc and a supporter of Vice President Kamala Harris, expressed his disapproval of wealthy business figures backing Donald Trump in the 2024 election. Diller, a longtime Democratic Party supporter, shared his views in recent interviews. Read the full article here.\nKamala Harris Pledges To Remove Unnecessary Degree Requirements\nVice President and Democratic presidential nominee Kamala Harris reiterated her commitment to eliminating degree prerequisites for certain federal jobs. She also urged the private sector to follow suit, stating that a college degree isn’t the only measure of a qualified worker. Read the full article here.\nOil Prices Drop Following Netanyahu’s Statement\nCrude oil prices saw a significant drop after Israeli Prime Minister Benjamin Netanyahu stated his willingness to strike military targets in Iran instead of oil or nuclear facilities. This statement was made during a call with President Joe Biden last Wednesday. Read the full article here.\nMark Cuban And Kevin O’Leary Clash Over China Tariffs\n\"Shark Tank\" co-stars Mark Cuban and Kevin O’Leary engaged in a public disagreement over tariffs on China. O’Leary called for a massive 400% increase in tariffs, citing unfair business practices by China. However, Cuban expressed his concerns over this approach. Read the full article here.\nRead Next: Kamala Harris Pulls A Reverse Card, Puts Trump At Fault For Border Crisis In Fox News Interview: ‘Let’s Just Get To The Point, Ok?’\nImage via Wikimedia Commons\n This story was generated using Benzinga Neuro and edited by Anan Ashraf.",
        "date": "2024-10-20",
        "time": "01:58:14",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417421/peter-schiff-criticizes-trumps-tariff-strategy-oil-prices-drop-following-netanyahus-statement-kamala"
    },
    {
        "title": "Bitcoin Landfill Lawsuit, Coinbase CEO's Musk Admiration, Anthony Scaramucci's BTC Investment And More: This Week In Crypto",
        "body": "This past weekend was a whirlwind of activity in the cryptocurrency world. From a man suing a city council over lost Bitcoins (CRYPTO: BTC) to the Coinbase CEO expressing admiration for Elon Musk’s productivity, the stories were as diverse as they were intriguing. Here’s a quick recap of the top stories that made headlines.\nBitcoin Landfill Lawsuit: James Howells, a software engineer from Wales, has filed a lawsuit against Newport City Council. Howells is seeking damages of approximately £495.31 million ($647 million) after the council repeatedly denied his requests to excavate a landfill site where he accidentally discarded a hard drive containing around 8,000 units of Bitcoin. The lawsuit is a strategy to persuade the council to allow the excavation, not a reflection of the actual situation. Read the full article here.\nArmstrong’s Musk Admiration: Brian Armstrong, CEO of Coinbase, expressed his admiration for Elon Musk’s efficiency and productivity. Armstrong suggested that a rigorous study should be conducted to understand how Musk achieves so much. He believes that understanding Musk’s productivity could be an important question for civilizational progress. Read the full article here.\nSee Also: If You Invested $100 In Dogecoin When Elon Musk First Tweeted About The Meme Crypto, Here’s How Much You’d Have Today\nScaramucci’s Bitcoin Investment: Anthony Scaramucci, CEO of SkyBridge Capital, revealed during a podcast that he has significant investments in Bitcoin. Scaramucci shared anecdotes about his conversation with MicroStrategy CEO Michael Saylor, who had a unique perspective on Scaramucci’s recommendation of a 1-3% allocation to Bitcoin. Read the full article here.\nCrypto Market Predictions: Cryptocurrency markets were trading higher as of Wednesday, taking 96% of Bitcoin holders into profit. Trader Michaёl van de Poppe now predicts all-time high prices in the ‘next 3-4 weeks’. Read the full article here.\nWarren vs. Deaton: Sen. Elizabeth Warren and her Republican challenger John Deaton exchanged heated words over cryptocurrencies during their first debate. Warren accused Deaton of receiving maximum funding from the big cryptocurrency lobby to win the Massachusetts seat. Read the full article here.\nRead Next: Benzinga Bulls And Bears: Apple, Tesla, Netflix, Oklo — And Dogecoin, Meme Coins Outpace Corporate Giants\nPhoto courtesy: Unsplash\n This story was generated using Benzinga Neuro and edited by Anan Ashraf.",
        "date": "2024-10-20",
        "time": "01:55:51",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/markets/cryptocurrency/24/10/41417413/bitcoin-landfill-lawsuit-coinbase-ceos-musk-admiration-anthony-scaramuccis-btc-investment-"
    },
    {
        "title": "Elon Musk's Pro-Trump Super PAC To Give $1M Every Day To People In Swing States For Signing His Petition",
        "body": "Billionaire Elon Musk on Saturday reportedly gave away $1 million to a man named John Dreher who attended his event in Pennsylvania aimed at rallying support for former President Donald Trump. \nWhat Happened: Musk on Saturday said that America PAC, a pro-Trump super PAC founded by the billionaire, will give $1 million every day through Nov.5 to someone in swing states who signs his online petition. The online petition asks people to pledge their support to the First and Second Amendments which guarantee freedom of speech and the right to bear arms. \n\nEvery day, from now through Nov 5, @America PAC will be giving away $1M to someone in swing states who signed our petition to support free speech & the right to bear arms!We want to make sure that everyone in swing states hears about this and I suspect this will ensure they do.— Elon Musk (@elonmusk) October 20, 2024\n\nEarlier this week, Musk also said that registered Pennsylvania voters will get $100 for signing the petition until Monday midnight, together with the person who referred them. \n\nIf you're a registered Pennsylvania voter, you & whoever referred you will now get $100 for signing our petition in support of free speech & right to bear arms.Earn money for supporting something you already believe in!Offer valid until midnight on Monday.— Elon Musk (@elonmusk) October 18, 2024\n\nMusk is now giving talks in Pennsylvania as part of his campaigning for Trump. On Saturday, Musk gave $1 million to John Dreher, an attendee at his rally, Reuters reported. \nGuests at the talk only need to have signed the petition to attend, Musk said earlier this week. The petition allows the PAC to garner contact details to campaign for Trump. \nWhy It Matters: Musk officially endorsed Trump in July after a shooting incident at a rally in Pennsylvania. The billionaire also attended a Trump campaign event in Pennsylvania earlier this month and termed the election a “must-win situation” for Trump.\nTrump, meanwhile, has expressed his intent to set up a government efficiency commission led by Musk if elected President. The commission will be tasked with conducting a complete financial and performance audit of the federal government and recommending reforms, Trump said in September.\nEarlier this week, Musk gave around $75 million to America PAC in a span of three months from July to September for canvassing voters, cementing him as a key figure in Trump’s presidential campaign against Vice President Kamala Harris.\nRead Next:\n\nKamala Harris Blames Amber Thurman’s Death On Georgia Abortion Law, Slams Trump For ‘Cruel’ Remarks\n\nImage via Wikimedia",
        "date": "2024-10-20",
        "time": "01:37:23",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417390/elon-musks-pro-trump-super-pac-to-give-1m-every-day-to-people-in-swing-states-for-signing-his-petiti"
    },
    {
        "title": "US Offers $10M Reward For Intel On Russian Firm Interfering In Elections",
        "body": "United States Department of State said earlier this week that it is offering a reward of up to $10 million for information on any foreign person or entity who has engaged or is engaging in interference in the 2024 U.S. presidential election set to be held on Nov. 5.\nWhat Happened: The award will be offered under the department’s Rewards for Justice program. Any information leading to the identification and location of the interferer as well as information leading to the prevention or resolution of an act of foreign election interference will be rewarded, the department said. \nThe announcement from the department's Rewards for Justice program specifically mentioned Rybar LLC, a Russian media organization. \nRybar, the department said, received funds for contracted work from Russian defense industrial organization Rostec, which was sanctioned by the U.S. Department of the Treasury in June 2022.\nRybar’s Operations: Rybar has sought to “sow discord, promote social division, stoke partisan and racial discord, and encourage hate and violence in the United States” through its social media channels, the announcement said. It manages the social media channels #HOLDTHELINE and #STANDWTHTEXAS to promote Russia’s political interests, in addition to TEXASvsUSA channel on social media platform X, it added. \nThe department also named nine individuals who it says worked to carry out Rybar’s operations aimed at impacting the U.S. electoral process.\nThose with knowledge of these individuals or their activities can contact Rewards for Justice via its tip line, it added.\nRead More:\n\nElon Musk, Tesla Refute Inefficiency Concerns With Wireless Charging On Cybercab: ‘There Is No Meaningful Efficiency Difference…'\n\nImage via Shutterstock",
        "date": "2024-10-20",
        "time": "02:45:04",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417457/us-offers-10m-reward-for-intel-on-russian-firm-interfering-in-elections"
    },
    {
        "title": "Cuban Vs Ackman, Dalio's Advice To China, Krugman's Warning, And More: This Week In Economics",
        "body": "This week was a whirlwind of financial news, with billionaires clashing over political policies, renowned investors offering advice to world leaders, and economists warning against potential economic pitfalls. Let’s dive into the top stories that made headlines.\nMark Cuban And Bill Ackman Lock Horns Over Harris’ Tax Proposal\nMark Cuban and Bill Ackman found themselves at odds over Democratic presidential candidate Kamala Harris‘ tax proposal for startups. Ackman, a staunch supporter of Donald Trump, labeled Harris’ proposal as “extremely misleading,” sparking a heated exchange with Cuban.\nRead the full article here.\nRay Dalio’s Strategy For China’s Debt Crisis\nBillionaire investor Ray Dalio has urged China to adopt a “beautiful deleveraging” strategy to prevent a looming debt crisis. Dalio believes that China’s recent stimulus measures should be balanced with debt restructuring, money printing, and debt monetization.\nRead the full article here.\nSee Also: Hedge Fund Billionaire Daniel Loeb Bets On Trump Win, Singles Out This Recent Buy As Having ‘Significant Upside Potential’\nPaul Krugman’s Warning On Trump’s Tariff Plan\nNobel laureate Paul Krugman has warned that former President Donald Trump’s proposed tariff plan could set back economic progress by 90 years and potentially ignite global conflict. Trump’s suggestion of tariffs as high as 20%, including a 60% tariff on imports from China, has been met with widespread opposition from economists.\nRead the full article here.\nFormer FDIC Chief’s Warning To Federal Reserve\nFormer FDIC Chief Sheila Bair has expressed concern over the Federal Reserve’s potential rate cuts amidst a thriving economy. Despite positive economic indicators, the Federal Reserve, led by Chair Jerome Powell, is considering further rate cuts to stimulate a perceived cooling labor market.\nRead the full article here.\nTrump’s Potential Federal Reserve Pick Defends Rate Cuts\nKevin Hassett, Donald Trump’s potential nominee for the Federal Reserve, has defended the central bank’s recent interest rate reduction, despite Trump’s criticism. Hassett justified the rate cut, citing a weakening jobs market.\nRead the full article here.\nRead Next: \n\nEXCLUSIVE: Robinhood's Bitstamp Deal Will Drive Growth, Exec Says: ‘What Was Good For Stocks … We Brought Into Crypto'\n\nPhoto courtesy: Shutterstock\nThis story was generated using Benzinga Neuro and edited by Ananya Gairola",
        "date": "2024-10-20",
        "time": "06:00:45",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417682/cuban-vs-ackman-dalios-advice-to-china-krugmans-warning-and-more-this-week-in-economics"
    },
    {
        "title": "Apple's Week In Review: From Termining Self-Driving Car Permit To Setting iPhone Sales Records",
        "body": "The past week has been a rollercoaster for Apple Inc. (NASDAQ:AAPL). The tech giant made headlines with its decision to abandon its self-driving car project, the revelation of a secret partnership with Chinese EV manufacturer BYD, and record-breaking iPhone sales. Let’s dive into the details of these stories.\nApple Abandons Autonomous Vehicle Project\nApple has officially terminated its self-driving vehicle testing permit in California, following its earlier decision to abandon its electric vehicle project. The California Department of Motor Vehicles confirmed that Apple requested the cancellation on Sept. 25, with the permit officially ending on Sept. 27. This move aligns with previous reports indicating Apple’s retreat from the electric vehicle market after a decade-long effort.\nRead the full article here.\nApple’s Secret Partnership with BYD\nIn a surprising revelation, it was reported that Apple had a secret partnership with Chinese electric vehicle manufacturer BYD to create long-range electric vehicle batteries. The partnership, which started in 2017, aimed to develop a battery system using lithium iron phosphate cells. While Apple does not own any technology used in BYD's current Blade batteries, this development proves Cupertino’s efforts to produce a car.\nRead the full article here.\nSee Also: Elon Musk Applauds Spotify After Streaming Giant Reveals Its Audiobook Catalog Has Doubled To 300K Titles\nRecord-Breaking iPhone Sales\nApple set a new sales record for its iPhone during the third quarter of 2024, coinciding with a broader recovery in the global smartphone market. According to Canalys, Apple's iPhone sales were narrowly edged out by Samsung Electronics Co. Ltd., with both tech giants capturing an 18% market share.\nRead the full article here.\nApple’s Low-Cost Vision Pro\nApple is reportedly ramping up its efforts to compete with Meta Platforms Inc. The iPhone maker’s discounted version of the first-generation mixed-reality headset, Vision Pro, could be ready by next year. Over the weekend, it was reported that Apple's Vision Pro team is working on at least four new devices that address current criticisms.\nRead the full article here.\nApple’s Inventory Shortage\nApple is reportedly experiencing a shortage in inventory for several of its products, leading to speculation about the imminent launch of new models. Retail inventory for several Apple products, including iMacs, MacBook Pros, Mac minis, iPad minis, and their accessories, is running low. Such inventory shortages are often indicative of a company preparing to introduce updated versions of its products.\nRead the full article here.\nRead Next:\n\nMeta Employee Making $400K A Year Says They Were Fired After Using $25 Dinner Credit To Buy Toothpaste\n\nPhoto courtesy: Unsplash\nThis story was generated using Benzinga Neuro and edited by Rounak Jain",
        "date": "2024-10-20",
        "time": "07:00:19",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417776/apples-week-in-review-from-termining-self-driving-car-permit-to-setting-iphone-sales-records"
    },
    {
        "title": "Trump's Rally Hits a Sour Note: Audio Woes And Frustrations In Detroit",
        "body": "During a rally in Detroit, Donald Trump greeted a packed audience after a 17-minute audio malfunction prevented him from speaking.\nThis incident marked the second time a week that a Trump rally faced disruption, a notable concern as the campaign against Vice President Kamala Harris enters its final days, reported NBC News.\nRecent polling suggests the race is tightly contested, making these missteps particularly impactful.\nDuring the audio outage, Trump roamed the stage, interacting with technical staff and attendees, but refrained from mingling with the crowd. When the sound was restored, he did not hold back his frustration.\n“I won’t pay the bill for this stupid company,” he declared, blaming the unnamed audio provider for the disruption, NBC News added.\nHe further threatened, “If it goes out again, I’ll sue the a– off that company.”\nAlso Read: Harris Clings To Narrow National Lead As Trump Gains Ground\nDespite the setback, the rally continued for another hour. However, Trump struggled to shake off the initial audio problems, lamenting that he had to “scream” to make himself heard, even after the system was back up and running.\nIn a lighter moment, Trump jokingly expressed his desire for Michigan Republican Senate nominee Mike Rogers to join him on stage, but quipped that he didn’t want Rogers to speak from the “crappy” microphone. Ultimately, Rogers did not make an appearance alongside Trump.\nAs the campaign enters its final weeks, these audio failures serve as a reminder of the challenges faced on the trail, especially in such a crucial political landscape.\nRead Next:\n\nHarris Vs. Trump: Vice President Holds Lead In 2024 Election Poll, But Former President Is Closing The Gap",
        "date": "2024-10-20",
        "time": "08:00:18",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41417915/trumps-rally-hits-a-sour-note-audio-woes-and-frustrations-in-detroit"
    },
    {
        "title": "AI Power Demand Skyrockets, Nvidia CEO Lauds OpenAI, And Tesla's Optimus Robots Assisted By Humans: This Week In AI",
        "body": "The past week was buzzing with tech news, with a major focus on the rapid expansion of AI and its implications. From the “mind-blowing” demand for AI power to the “awakening of AI” led by ChatGPT, the tech world is witnessing a significant shift. Here are the key stories that made headlines.\nOklo CEO Highlights ‘Mind-Blowing’ Demand For AI Power\nCo-founder and CEO of Oklo Inc. (NYSE:OKLO), Jacob DeWitte, expressed his optimism about the future of nuclear power startups in the tech industry. He believes that Alphabet Inc.'s nuclear deal with Kairos Power is just the beginning of a series of collaborations between nuclear power startups and big tech companies. DeWitte highlighted the staggering demand for nuclear power driven by the rapid expansion of AI.\nRead the full article here.\nNvidia’s Jensen Huang Praises OpenAI\nIn a recent podcast, Nvidia Corp. (NASDAQ:NVDA) CEO Jensen Huang lauded OpenAI as one of the most influential companies of today's era. Despite several high-profile departures, OpenAI recently raised $6.6 billion at a $157 billion valuation.\nRead the full article here.\nSee Also: iPhone 15 Pro Models and iPhone 13 Discontinued By Apple: Here’s Why\nTesla’s Optimus Robots Assisted by Humans\nDuring the recent “We, Robot” event, Tesla, Inc. (NASDAQ:TSLA) showcased its humanoid robot, Optimus. However, a Bloomberg report revealed that humans were remotely assisting the Optimus robot prototypes with some functions.\nRead the full article here.\nNvidia CEO Praises Elon Musk’s xAI Achievement\nNvidia CEO Huang praised Musk for his achievement with xAI, stating that Musk achieved something with xAI in 19 days which usually takes at least a year. Huang shared his thoughts during an episode of the Bg2 Pod.\nRead the full article here.\nAmazon Strikes at Nvidia’s Stronghold Through Databricks Deal\nAmazon.com Inc (NASDAQ:AMZN) has signed a five-year deal with data and AI startup Databricks. The deal centers around Amazon's Trainium AI chips, which offer a less expensive alternative to Nvidia Corp's popular GPUs for companies looking to customize or build their AI models.\nRead the full article here.\nRead Next:\n\nMeta Confirms Layoffs Across Instagram, WhatsApp And Reality Labs Amid Strategic Reshuffle\n\nPhoto courtesy: Shutterstock\nThis story was generated using Benzinga Neuro and edited by Rounak Jain",
        "date": "2024-10-20",
        "time": "09:01:13",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41418188/ai-power-demand-skyrockets-nvidia-ceo-lauds-openai-and-teslas-optimus-robots-assisted-by-humans-this"
    },
    {
        "title": "'Great Wealth Transfer' Poses Both Risks And Opportunities For Financial Advisors",
        "body": "A recent survey by Naxtisis Investment Managers reveals that financial advisors worldwide are concerned about retaining clients and assets during the impending “Great Wealth Transfer.” This massive transfer of over $84 trillion in assets over the next two decades is seen as a significant threat by 41% of advisors.\nThe survey, conducted among 2,700 advisors across 20 countries, found that 30% worry about retaining assets from clients’ spouses or children. While advisors report retaining 78% of relationships when spouses inherit, this drops to 58% with clients’ children. Overall, 22% of advisors have already lost significant assets through generational attrition.\nTo combat this trend, advisors are aiming to add an average of 16 new clients annually and grow their AUM by 11%. Relationship-building is cited by 92% of advisors as their primary retention strategy. Many are extending family wealth planning discussions to clients’ family members and offering additional services like trust and networking services.\nAlso Read: SPY Reaches $600 Billion In Assets: Oldest US ETF Hits Milestone As All-Time Highs Continue\nHowever, advisors face challenges in prospecting for new clients, dedicating only 8% of their weekly time to this task. They’re prioritizing pre-retirees and those entering retirement, with 96% focusing on the 50-60 age group and 88% on the 60-65 age bracket. Interestingly, 46% are also targeting younger accumulators aged 35-50, while only 14% are prospecting among the 18-35 age group.\nTo enhance their prospecting efforts, about half of the advisors plan to create dedicated prospecting teams. Many are also leveraging social media strategies (43%) and considering AI-powered tools (21%) for client acquisition.\nDave Goodsell, executive director of the Natixis Center for Investor Insight, emphasizes the importance of asking existing clients for referrals as a key growth strategy. He also notes that deepening relationships with clients and expanding financial planning services will be crucial for long-term success in the face of these demographic shifts and competitive pressures.\nAs the wealth transfer accelerates, advisors must adapt their strategies to navigate both short-term economic risks and long-term business challenges to ensure the continuity and growth of their practices.\nRead Next:\n\nBenzinga’s ‘Stock Whisper’ Index: 5 Stocks Investors Secretly Monitor But Don’t Talk About Yet\n\nPhoto: Shutterstock",
        "date": "2024-10-20",
        "time": "12:30:50",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/personal-finance/financial-advisors/24/10/41418601/great-wealth-transfer-poses-both-risks-and-opportunities-for-financial-adviso"
    },
    {
        "title": "Market 'Mega-Bubble' Set To Pop, Says Top Economist Who Called 2008 Crash",
        "body": "Top economist David Rosenberg, known for predicting the 2008 market crash and recession, is sounding the alarm about a potential stock market crash.\nMega-Bubble: In recent notes to Rosenberg Research clients, the market bear warned that the current market is in a “mega-bubble” and cautioned investors against chasing momentum. \n“When this mega-bubble pops, it will be spectacular,” Rosenberg wrote on Oct. 18. “This is no time to chase momentum or the herd mentality.”\nWarning Signs: Rosenberg cited high valuations, investor positioning and sentiment as warning signs. The most recent AAII Sentiment Survey, which tracks investor sentiment, shows 45.5% of its respondents characterized themselves as bullish, above its historical average of 37.5% for the 49th time in 50 weeks.  \n“This is the mother of all momentum-driven stock markets,” he wrote in an October 9 note.\nRead Next: Lucid CEO Peter Rawlinson Talks Saudi Investment, Elon Musk’s Political Views And Taking Business From Tesla\nRosenberg warned the S&P 500 is at least 25% higher than fundamentals suggest it should be with stock prices outpacing earnings growth and analyst EPS revisions trending to the downside. \nThe economist is bearish on the economy as well as the markets and anticipates a recession on the horizon. Rosenberg pointed to emerging signs of economic weakness, including a rise in unemployment and decreased job openings. \nRosenberg's warnings come at a time when the S&P 500 has seen significant gains, up 23% year-to-date following gains of 22% in 2023. Investors can track the S&P 500 through funds that track the index's movements, including the SPDR S&P 500 (NYSE:SPY), known as the \"Spy,\" and the iShares Core S&P 500 ETF (NYSE:IVV). \nRosenberg cautioned investors against chasing the \"overvalued\" market and advised clients to preserve capital. \n“J.P. Morgan reportedly once commented that he got wealthy not by buying at the lows and selling at the highs, but rather by being involved in the middle 60% of the bull market. We are well past that point,”  Rosenberg wrote. \nRead Also: \n\nMicrosoft AI Revenue ‘Could Eclipse’ $10B In 2025, Bullish Analyst Says\n\nImage: Shutterstock",
        "date": "2024-10-20",
        "time": "13:00:42",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41418655/market-mega-bubble-set-to-pop-says-top-economist-who-called-2008-crash"
    },
    {
        "title": "Warren Buffett's Words Of Wisdom: Benzinga Readers Pick Their Favorite Oracle Of Omaha Quote",
        "body": "Legendary investor Warren Buffett is known for his history of strong gains for Berkshire Hathaway Inc (NYSE:BRK)(NYSE:BRK) that often beat the broader stock market indexes.\nBuffett is also known for his sharp wit and quotable quotes that many in the investing community refer to on a daily, weekly or monthly basis.\nBenzinga recently put some of Buffett's best quotes to the test.\n\"Which Warren Buffett quote resonates with you the most?\" Benzinga asked.\nThe results were:\n\n\"Be fearful when others are greedy and greedy when others are fearful.\": 33%\n\"The best investment you can make is in yourself.\": 28%\n\"Rule No. 1: Never lose money. Rule No. 2: Never forget rule No. 1.\": 24%\n\"Someone's sitting in the shade today because someone planted a tree a long time ago\": 12%  \n\"Cryptocurrency is probably rat poison squared.\": 3%\n\nThe winning quote came from Buffett during the 2008 financial crisis with the investor sharing in an op-ed piece in the New York Times that he was buying American stocks as share prices had fallen dramatically.\nYou may not be a billionaire like Warren Buffett, but you can uncover hidden gems in the stock market using our proprietary data and pattern recognition — check out five stocks flying under the radar that deserve your attention.\nWhile many Benzinga readers picked the \"be fearful\" and \"the best investment\" quotes, third place \"Rule No. 1\" is perhaps Buffett's most well-known quote.\nThere likely isn't a bad quote among the bunch when it comes to applying Buffett's investing wisdom, save for the last one.\nWhile many have made money in the cryptocurrency sector and see the long-term potential, Buffett has not come around and likely never will. Buffett has compared Bitcoin (CRYPTO: BTC) to rat poison squared and also said he wouldn't buy all the Bitcoin in the world for $25.\nBuffett’s strong investing returns and quotable quotes could be the reason a recent Benzinga poll found the legendary investor voted the most likely person to go down as the most legendary investor in 100 years with 61% of the vote. Buffett beat Elon Musk, Jeff Bezos and Mark Cuban in the poll.\nRead Next: \n\nIf You Invested $1,000 In Bitcoin When Warren Buffett Called It ‘Rat Poison Squared,’ Here’s How Much You’d Have Today\n\nThe study was conducted by Benzinga from Oct. 15 through Oct. 17, 2024, and included the responses of a diverse population of adults 18 or older. Opting into the survey was completely voluntary, with no incentives offered to potential respondents. The study reflects results from 108 adults.\nPhoto: Shutterstock",
        "date": "2024-10-20",
        "time": "13:30:22",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/general/education/24/10/41418702/warren-buffetts-words-of-wisdom-benzinga-readers-pick-their-favorite-oracle-of-omaha-quote"
    },
    {
        "title": "Consumer Tech News (Oct 14-18): Biden Administration Considers Imposing Restrictions On Chip Sales, Apple Inks Secret Deal With BYD & More",
        "body": "The European Union's NIS 2 cybersecurity directive, now enforceable, mandates companies to bolster their cybersecurity practices or face hefty fines.\nChinese researchers have successfully used D-Wave‘s quantum annealing systems to break classic encryption RSA, potentially accelerating the timeline for when quantum computers could pose a real threat to widely used cryptographic systems.\nRepublican presidential nominee Donald Trump's 2024 campaign has decided not to advertise on Snap Inc.‘s (NYSE:SNAP) Snapchat, a platform favored by young voters.\nAmid growing concerns from the U.S. about the potential diversion of advanced chip technology to China, the UAE has assured its commitment to safeguarding these technologies.\nThe assurance comes as the Biden administration considers imposing restrictions on chip sales from NVIDIA Corporation (NASDAQ:NVDA) and Advanced Micro Devices, Inc. (NASDAQ:AMD) to the Middle East.\nGaming\nThe latest figures from Circana reveal a dip in U.S. video game spending for August 2024, with total expenditure dropping 7% year-on-year to $4.1 billion. Hardware sales fell 36%, driven by a 41% decline in Switch sales.\nMicrosoft Corporation (NASDAQ:MSFT) discontinued its $1 for 14 days Game Pass trial just before the launch of Call of Duty: Black Ops 6, which is set to release directly on Game Pass next week.\nMicrosoft settles the antitrust lawsuit over its $69 billion Activision Blizzard acquisition, with undisclosed terms and no refiling allowed.\nMicrosoft is set to expand its cloud gaming capabilities by introducing support for player-owned Xbox games, a long-anticipated feature that will allow users to stream titles from their personal game libraries.\nElectronic Arts Inc. (NASDAQ:EA) will shut down Plants vs. Zombies 3 on November 15, 2024, halting downloads and in-app purchases in preparation for a \"major overhaul.\"\nRiot Games, the studio behind League of Legends, announced a series of layoffs affecting its League of Legends PC development team, alongside plans for future expansion.\nBandai Namco Holdings, Inc. (OTC:NCBDY) faces workforce shifts and project cancellations despite the success of Dragon Ball Z: Sparking! Zero’s 3 million unit sales.\nAlso Read: Elon Musk Applauds Spotify After Streaming Giant Reveals Its Audiobook Catalog Has Doubled To 300K Titles\nSmartphones\nApple Inc. (NASDAQ:AAPL) reportedly had a secret partnership with Chinese electric vehicle manufacturer BYD Co Ltd (OTC:BYDDY) to create long-range electric vehicle batteries.\nApple is expanding its payment offerings within Apple Pay, providing users with more flexible online and in-app purchase options. The company is introducing installment loan features and increasing the availability of rewards programs.\nApple unveiled the upgraded version of its iPad Mini, marking the first significant upgrade to the compact tablet since 2021.\nApple has set a new sales record for its iPhone during the third quarter of 2024, coinciding with a broader recovery in the global smartphone market.\nApple is reportedly ramping up its efforts to compete with Meta Platforms, Inc. (NASDAQ:META). The iPhone maker’s discounted version of the first-generation mixed-reality headset, Vision Pro, could be ready by next year.\nApple has terminated its self-driving vehicle testing permit in California. The decision follows the company's earlier abandonment of its electric vehicle project.\nApple is reportedly experiencing a shortage in inventory for several of its products, leading to speculation about the imminent launch of new models.\nSamsung Electronics Co Ltd. (OTC:SSNLF) is reportedly preparing to unveil its \"Special Edition\" Galaxy Z Fold 6 as early as next week.\nSocial Media, AI & Technology\nYouTube, a subsidiary of Alphabet Inc.‘s (NASDAQ:GOOG) Google, is extending its \"Premium Lite\" plan to additional countries, offering a more affordable subscription with fewer ads.\nYouTube has unveiled a significant update that introduces a range of new features designed to enhance the user experience and foster a stronger connection between creators and their audiences.\nGoogle has requested the 9th Circuit Court of Appeals to put a stop to the impending changes mandated by Judge James Donato's ruling in the Epic v. Google case.\nGoogle has officially begun rolling out Android 15, the latest version of its mobile operating system, to Pixel devices today.\nMeta confirmed layoffs across multiple teams, including Instagram, WhatsApp, and Reality Labs.\nOn Tuesday, U.S. District Judge Yvonne Gonzalez Rogers in California rejected Meta's attempt to dismiss the claims made in two separate lawsuits filed last year. The lawsuits involving over 30 states, including California, New York, and Florida, accuse Meta of contributing to mental health issues among teenagers by making its platforms addictive.\nTaiwan Semiconductor Manufacturing Co. Ltd. (NYSE:TSM) reportedly started manufacturing A16 chips for Apple at its Phoenix, Arizona facility. This move is part of the U.S. strategy to enhance domestic semiconductor production.\nSebastien Bubeck, the vice president of GenAI research at Microsoft is set to join ChatGPT-parent, OpenAI.\nRead: Nvidia’s Jensen Huang Says ChatGPT Led To ‘Awakening Of AI,’ Praises Sam Altman’s OpenAI As One Of Most Consequential Companies Of Our Time",
        "date": "2024-10-20",
        "time": "13:45:54",
        "source": "Benzinga",
        "url": "https://www.benzinga.com/news/24/10/41418732/consumer-tech-news-oct-14-18-biden-administration-considers-imposing-restrictions-on-chip-sales-appl"
    }
]