[
  {
    "url": "https://www.bbc.com/news",
    "title": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world",
    "description": "The US special envoy to the Middle East is in Israel today, after Canada joined the UK and France in planning to recognise Palestine.",
    "full_content": "Trump says Canada's move to recognise Palestinian state threatens trade deal\n\nThe US special envoy to the Middle East is in Israel today, after Canada joined the UK and France in planning to recognise Palestine.\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIsrael's military says fired \"warning shots\" as crowds gathered around aid lorries but was \"not aware of any casualties\" from its fire.\n\nWhy Australians celebrate Christmas twice a year\n\nThe Australian tradition was born in the 1980s after a group of Irishmen became homesick for a winter Christmas.\n\nWhat screen time does to children's brains is more complicated than it seems\n\nScreen time has become synonymous with bad news - but the science may not be as straightforward as it seems\n\nIndia court acquits seven accused in 2008 Malegaon blast case\n\nSix people were killed and nearly a hundred injured in the attack 17 years ago.\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIsrael's military says fired \"warning shots\" as crowds gathered around aid lorries but was \"not aware of any casualties\" from its fire.\n\nTrump's tariffs could deal a blow to India's growth and exports\n\nThe effect on India's GDP is unclear as Trump announced an unspecified penalty in addition to 25% tariffs.\n\nTrump announces deal to impose 15% tariff on South Korea\n\nThe agreement comes just a day before a 1 August deadline for countries to strike deals with the US.\n\nSotheby's returns Buddha jewels to India after uproar\n\nThe Piprahwa Gems were due to be auctioned in May, but the sale was called off after diplomatic intervention.\n\nWhy Australians celebrate Christmas twice a year\n\nThe Australian tradition was born in the 1980s after a group of Irishmen became homesick for a winter Christmas.\n\nRussian strikes kill eight and hit Kyiv apartment block, officials say\n\nAustralian childcare worker charged with creating abuse videos\n\nVerifying drone and missile strikes in Ukraine\n\n'Communities' of strange, extreme life seen for first time in deep ocean\n\nTrump sanctions judge in Bolsonaro coup case and hits Brazil with 50% tariffs\n\nMore to explore\n\nFinger painting by artist with nerve injury wins Australian art award\n\n\"Without a brush, painting was almost painless,\" said Filipina-Australian artist Loribelle Spirovski.\n\nTikTok made songs shorter – but is the trend over?\n\nTikTok shrank songs - but now artists are pushing back with longer tracks with more emotional resonance.\n\nAid cuts will push Nigerians into arms of Boko Haram militants, UN warns\n\nThe end of food aid could have devastating effects for the victims of an Islamist insurgency.\n\nFirst Australian-made rocket crashes shortly after lift-off\n\nThe company behind the country's first orbital rocket called the launch a 'giant leap' despite crashing after only 14 seconds.\n\nOlympic star Dahlmeier dead after climbing accident\n\nTwo-time Olympic champion Laura Dahlmeier dies aged 31 after a mountaineering accident in Pakistan.\n\nTikTok made songs shorter – but is the trend over?\n\nTikTok shrank songs - but now artists are pushing back with longer tracks with more emotional resonance.\n\nWednesday fame was overwhelming, says Jenna Ortega\n\nThe 22-year-old said she didn't know if anyone would watch the Netflix series about Wednesday Addams.\n\nBritish 999 call handler's voice cloned by Russian network using AI\n\nA BBC Verify investigation has revealed that the identities of British public sector workers have been cloned using AI by a Russian-linked disinformation campaign.\n\nAid cuts will push Nigerians into arms of Boko Haram militants, UN warns\n\nThe end of food aid could have devastating effects for the victims of an Islamist insurgency.\n\nMost watched\n\nFirst Australian-made rocket crashes shortly after lift-off\n\nBritish 999 call handler's voice cloned by Russian network using AI\n\nWatch: Fighter jet swerves dramatically to avoid birds near packed beach\n\nSharon Osbourne and family look at Ozzy tributes in Birmingham\n\nWatch: Bus in flames in central London\n\nAlso in news\n\nHotel tycoon reveals Heathrow expansion proposal\n\nArora Group says a shorter runway will avoid the cost and disruption of diverting the M25 motorway.\n\nFed holds US interest rates steady despite Trump pressure\n\nBut support for a cut may be widening, as debates rage about how tariffs will affect the US economy.\n\nKamala Harris rules out running for California governor\n\n\"For now, my leadership - and public service - will not be in elected office,\" the former vice-president said in a statement.\n\nAustralian childcare worker charged with creating abuse videos\n\nAustralia is facing a reckoning over safety within its childcare sector, after a series of abuse cases.\n\nFrance-Spain flight row over Jewish teens escalates\n\nAurore Bergé and Benjamin Haddad condemn remarks by Spain's transport minister as a diplomatic spat continues.\n\nFed holds US interest rates steady despite Trump pressure\n\nBut support for a cut may be widening, as debates rage about how tariffs will affect the US economy.\n\nFrance-Spain flight row over Jewish teens escalates\n\nAurore Bergé and Benjamin Haddad condemn remarks by Spain's transport minister as a diplomatic spat continues.\n\nWhat screen time does to children's brains is more complicated than it seems\n\nTrump's tariffs could deal a blow to India's growth and exports\n\n'Communities' of strange, extreme life seen for first time in deep ocean\n\nSotheby's returns Buddha jewels to India after uproar\n\nFamily and fans give Ozzy Osbourne emotional send-off\n\nAustralian childcare worker charged with creating abuse videos\n\nWhy Australians celebrate Christmas twice a year\n\nHow Trump's tariffs are already impacting Americans\n\nWhat does recognising a Palestinian state mean?\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIndia rebuild after early Atkinson wicket in fifth Test at The Oval\n\nFollow live text, radio commentary and in-play video clips as England face India in the fifth Test at The Oval.\n\nWomen's Open: Hull one shot off lead after string of birdies\n\nFollow coverage of the first round of the AIG Women's Open at Royal Porthcawl in Wales.\n\nBrady queries Rooney's 'work ethic' at Birmingham\n\nBirmingham City minority owner Tom Brady questions former Blues manager Wayne Rooney's work ethic in a new Amazon Prime documentary series.\n\nKinghorn and Ryan in for final Lions Test\n\nBritish and Irish Lions coach Andy Farrell makes two changes for the final Test against the Wallabies in Sydney on Saturday.\n\nCounty Championship: Nine games as Surrey push for victory\n\nFollow live text and listen to BBC local radio commentaries from day three of the 11th round of the 2025 County Championship.\n\nWomen's Open: Hull one shot off lead after string of birdies\n\nFollow coverage of the first round of the AIG Women's Open at Royal Porthcawl in Wales.\n\nTransfer news: Latest on Sesko, Hato plus pre-season updates\n\nAll the latest transfer news as Man Utd target Leipzig striker Benjamin Sesko and Chelsea agree a deal forAjax defender Jorrel Hato.\n\n'I'd be lost without football' - the ex-Premier League striker playing at 49\n\nAs he approaches his 50th birthday, ex-Premier League striker Jamie Cureton tells BBC Sport why he is not ready to quit playing yet.\n\nBrady queries Rooney's 'work ethic' at Birmingham\n\nBirmingham City minority owner Tom Brady questions former Blues manager Wayne Rooney's work ethic in a new Amazon Prime documentary series.",
    "source": "BBC",
    "date": "2025-07-31",
    "time": "16:35:47",
    "extracted_at": "2025-07-31T16:35:47.787091"
  },
  {
    "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
    "title": "Israel Gaza war | Latest News & Updates | BBC News",
    "description": "Mark Carney says it depends on Palestinian democratic reforms, while Donald Trump says it could stymie a US-Canada trade deal.",
    "full_content": "Israel-Gaza war\n\nCanada follows France and UK with plan to recognise Palestinian state\n\nMark Carney says it depends on Palestinian democratic reforms, while Donald Trump says it could stymie a US-Canada trade deal.\n\nLammy hopes plan to recognise Palestinian state 'will get ceasefire'\n\nThe government has announced it will recognise a Palestinian state unless Israel agrees to end the crisis.\n\nMore than 60,000 people killed in Gaza during Israel offensive, Hamas-run health ministry says\n\nAt least 112 people were killed in the 24 hours before late Tuesday morning, 22 while trying to get aid, the ministry says.\n\nIsraeli rights groups accuse Israel of genocide in Gaza\n\nIsrael's government rejects the allegations in the separate reports by B'Tselem and Physicians for Human Rights-Israel.\n\nGaza air drops 'a grotesque distraction', aid agencies warn\n\nSeveral aid groups say dropping food from the air onto densely populated Gaza is a risk to civilian lives.\n\nLammy hopes plan to recognise Palestinian state 'will get ceasefire'\n\nThe government has announced it will recognise a Palestinian state unless Israel agrees to end the crisis.\n\nUK to recognise Palestinian state unless Israel meets conditions\n\nThe PM announces there will be a shift in policy in September, unless Israel takes steps including agreeing a ceasefire in Gaza.\n\nFamine 'currently playing out' in Gaza, UN-backed experts warn\n\nIt comes as aid agencies warn Israel's recent measures to increase aid supplies are not enough.\n\nMore than 60,000 people killed in Gaza during Israel offensive, Hamas-run health ministry says\n\nAt least 112 people were killed in the 24 hours before late Tuesday morning, 22 while trying to get aid, the ministry says.\n\nBowen: Starmer's announcement a big change for British foreign policy\n\nPM Sir Keir Starmer has said the UK will recognise a Palestinian state in September unless Israel takes \"substantive steps to end the appalling situation in Gaza\".\n\nWatch: How did Gaza get to the brink of starvation?\n\nThe BBC's diplomatic correspondent Paul Adams explains how the people of Gaza have reached a point of starvation.\n\nBowen: Air dropping aid is an act of desperation that won't end hunger in Gaza\n\nAir drops can look good on television, but deliver very little aid and endanger civilian lives.\n\n​​What is inside the GHF food aid box being distributed in Gaza?\n\nBBC Verify examines the meals handed out to Gazans - and why their nutritional value is questioned by some experts.\n\nFrench pledge to recognise Palestine is a gamble - so will Starmer follow suit?\n\nThe prime minister is facing pressure at home and abroad to recognise a Palestinian state.\n\nHuman stories\n\n'We need a real solution': Gazans welcome aid plan but fear it will not end crisis\n\nIsrael says aid convoys will be allowed into Gaza, after weeks of mounting pressure and warnings of starvation.\n\n'I'm so tired': Mother of starving Gazan baby speaks to BBC\n\nHedaya al-Muta'wi's 18-month-old son Mohammed suffers from malnutrition due to famine, weighing just 6kg.\n\nHe went to get aid and didn't come back - stories of people killed in Gaza\n\nAs aid agencies warn of \"mass starvation\", the BBC hears from the relatives of some of those killed in the past week.\n\n'All the people are hungry': Voices from Gaza on desperate lack of food\n\nAll week across the BBC we've been hearing from people in Gaza about their lives as food supplies are restricted leading to malnourishment and starvation.\n\nChurch leaders return with 'broken hearts' after rare visit to Gaza\n\nThe Latin and Greek Orthodox patriarchs of Jerusalem describing starving people not \"batting an eyelid\" at the sound of bombing.\n\nLatest updates\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIsrael's military says fired \"warning shots\" as crowds gathered around aid lorries but was \"not aware of any casualties\" from its fire.\n\nFreed hostage says Starmer 'risks rewarding terror'\n\nEmily Damari says the prime minister is \"not on the right side of history\" with his plan for a Palestinian state.\n\nSeven more die from malnutrition in Gaza, Hamas-run ministry says\n\nOn Tuesday, UN-backed global food security experts warned the worst-case scenario of famine is \"currently playing out\" in Gaza.\n\nIsrael and hostages' families condemn UK plan to recognise Palestinian state\n\nPrime Minister Benjamin Netanyahu and the Hostages Forum say the UK's announcement is a \"reward\" for Hamas.\n\nWhat does recognising a Palestinian state mean?\n\nPrime Minister Sir Keir Starmer has announced that the UK will recognise a Palestinian state in September unless Israel meets certain conditions.\n\nThe delicate politics behind the UK's move on Palestinian statehood\n\nThe government's statehood policy marks a hugely significant shift in the UK's diplomatic stance.\n\nLammy hopes plan to recognise Palestinian state 'will get ceasefire'\n\nThe government has announced it will recognise a Palestinian state unless Israel agrees to end the crisis.\n\n'If she remains in Gaza, she will die'\n\nYasmeen Abu Sultan told the BBC that she struggles to feed her two-month-old daughter and asked that her baby is taken out of Gaza to undertake medical treatment.\n\nBowen: UK move to recognise Palestinian state is a diplomatic crowbar to revive peace process\n\nSuch a move would be a major departure from UK foreign policy.",
    "source": "BBC",
    "date": "2025-07-31",
    "time": "16:35:49",
    "extracted_at": "2025-07-31T16:35:49.145554"
  },
  {
    "url": "https://www.bbc.com/news/war-in-ukraine",
    "title": "Ukraine War | Latest News & Updates| BBC News",
    "description": "A boy and his mother are among the dead and Kyiv says it has seen the biggest number of child casualties of the war.",
    "full_content": "War in Ukraine\n\nRussian strikes kill eight and hit Kyiv apartment block, officials say\n\nA boy and his mother are among the dead and Kyiv says it has seen the biggest number of child casualties of the war.\n\nRussian missile hits Ukrainian training unit, killing and wounding servicemen\n\nUkraine's military says three people were killed as Russia posted video of what it said was the strike.\n\nFive killed as Ukraine and Russia trade drone attacks\n\nThree people die in strikes on Dnipro in Ukraine, while two are killed in Russia's Rostov region.\n\nSchool-leavers losing their lives for Russia in Putin's war with Ukraine\n\nRussia has promised that no 18-year-olds will be sent to fight in Ukraine, but the BBC finds many have already been killed.\n\nRussia and Ukraine trade drone attacks after latest ceasefire talks\n\nDeaths have been reported on either side of the border, just hours after a third round of ceasefire talks took place in Turkey.\n\nRussian missile hits Ukrainian training unit, killing and wounding servicemen\n\nUkraine's military says three people were killed as Russia posted video of what it said was the strike.\n\nPutin must agree Ukraine ceasefire in 10 or 12 days, says Trump\n\nThe US president says there is \"no reason\" for waiting amid little sign of progress towards peace.\n\nPro-Ukraine hacker group claims Aeroflot cyber-attack\n\nThe Kremlin says reports of a cyber-attack on Russia's national carrier Aeroflot are \"worrying\".\n\nFive killed as Ukraine and Russia trade drone attacks\n\nThree people die in strikes on Dnipro in Ukraine, while two are killed in Russia's Rostov region.\n\nRussian soldiers scammed and robbed of war cash on return from Ukraine\n\nA number of cases emerge of servicemen targeted for their salaries and pay-offs by government officials.\n\nBacklash grows after Zelensky strips anti-corruption bodies of independence\n\nProtests gather pace in Ukrainian cities as some of Kyiv's closest allies sound alarm bells.\n\nKill Russian soldiers, win points: Is Ukraine's new drone scheme gamifying war?\n\nThe scheme allows Ukrainian troops to trade videos of confirmed kills on the battlefield for prizes.\n\nRosenberg: Russia more relieved than rattled by US tariff threat\n\nThe US is threatening Moscow with financial consequences if a deal to end the Ukraine war is not reached within 50 days.\n\nTrump weapons pledge marks major step forward for Ukraine\n\nFor the first time since returning to the White House, Trump pledges to make new weapons available to Ukraine.\n\nOn the ground\n\nRussia's summer push in Ukraine targets three fronts but faces stern resistance\n\nAnalysis of Russia's advance in northern and eastern Ukraine in maps.\n\n'It's Groundhog Day': Ukraine's sky defenders stuck in relentless battle\n\nUnder fire of 100 drones a night, there's little talk of a ceasefire in the front-line city of Sumy.\n\nThe doctor fighting for women's health on Ukraine's front line\n\nDr Baksheiev, a gynaecologist, travels to front-line areas in his kitted out mobile clinic.\n\n'Mariupol is diseased': Residents deny Russian claims occupied city returning to normal\n\nRussian shattered Mariupol with a months-long siege in 2022. Now, it says it's rebuilding it.\n\nAfter a night of terror in Kyiv, the search for dead goes on\n\nA cruise missile slammed into an ordinary residential block early on Tuesday, likely travelling at about 500mph.\n\nQ&A: Big protests, brief talks and pressure on Zelensky\n\nUkraine saw nationwide demonstrations over controversial anti-corruption reforms.\n\nLatest updates\n\nRussian strikes kill eight and hit Kyiv apartment block, officials say\n\nA boy and his mother are among the dead and Kyiv says it has seen the biggest number of child casualties of the war.\n\nRussian missile hits Ukrainian training unit, killing and wounding servicemen\n\nUkraine's military says three people were killed as Russia posted video of what it said was the strike.\n\nRussian soldiers scammed and robbed of war cash on return from Ukraine\n\nA number of cases emerge of servicemen targeted for their salaries and pay-offs by government officials.\n\nRussian strikes kill 25 in Ukraine, as Trump confirms deadline for talks\n\nThe deadly Russian air strikes come as US President Donald Trump toughens truce ultimatum to Russia.\n\nMP joins ambulance and aid delivery to Ukraine\n\nRachel Taylor is going with aid workers to take an ambulance full of aid from Tamworth to Ukraine.\n\nPutin must agree Ukraine ceasefire in 10 or 12 days, says Trump\n\nThe US president says there is \"no reason\" for waiting amid little sign of progress towards peace.\n\nFive killed as Ukraine and Russia trade drone attacks\n\nThree people die in strikes on Dnipro in Ukraine, while two are killed in Russia's Rostov region.\n\nSchool-leavers losing their lives for Russia in Putin's war with Ukraine\n\nRussia has promised that no 18-year-olds will be sent to fight in Ukraine, but the BBC finds many have already been killed.\n\nRussia and Ukraine trade drone attacks after latest ceasefire talks\n\nDeaths have been reported on either side of the border, just hours after a third round of ceasefire talks took place in Turkey.",
    "source": "BBC",
    "date": "2025-07-31",
    "time": "16:35:51",
    "extracted_at": "2025-07-31T16:35:51.333938"
  },
  {
    "url": "https://www.cnn.com/newsletters",
    "title": "CNN newsletters: Subscribe for news, lifestyle, markets info and more | CNN",
    "description": "CNN News, delivered. Select from our newsletters below and enter your email to sign up.",
    "full_content": "Breaking News\n\nBe the first to know about the biggest stories as they break. Sign up for breaking news email alerts from CNN.\n\nFive Things AM\n\nWe‚Äôll summarize five stories you need to know before starting your day.\n\nFive Things PM\n\nWe recap the most fascinating stories to end your day on a positive note.\n\nFive Good Things\n\nGet inspired each week with the five most uplifting stories curated by the 5 Things team.\n\nFive Things Sunday\n\nPrepare for what‚Äôs next with a look at the big stories shaping up for the week ahead.\n\nThe Results are In with Dr. Sanjay Gupta\n\nDon't miss the latest expert advice, medical advancements and inspiring techniques to live a healthier, happier and longer life.\n\nThroughout the week\n\nReliable Sources\n\nCNN‚Äôs Reliable Sources examines the information economy, chronicling the evolving media landscape in a digest with uncompromising reporting and analysis.\n\nDaily Monday - Friday\n\nWhat Matters\n\nThe American system of government has been challenged to deal with a divided country. In this time of political, cultural and economic upheaval, we‚Äôre trying to connect the dots. We‚Äôll boil down What Matters and deliver it straight to your inbox.\n\nMeanwhile in America\n\nA weekly analysis of US politics for global readers. We‚Äôll explain how we got here, what it means and where America and the world are heading next.\n\nMeanwhile in China\n\nCNN‚Äôs reporters in Hong Kong, Beijing and around the world bring you a weekly update on the latest news you need to know about China‚Äôs rise, analysis on what it means for the world, and predictions on what could happen next.\n\nDaily Sunday - Friday\n\nFareed's Global Briefing\n\nInsights, analysis and must reads from CNN's Fareed Zakaria and the Global Public Square team.\n\nDaily Monday - Thursday\n\nCNN Business Nightcap\n\nWe read all day so you don‚Äôt have to. Sign up for CNN Business‚Äô nightly newsletter for the top stories you need to know.\n\nCNN Underscored\n\nCheck out reviews and recommendations for everything from tech to home decor to style and beauty products. CNN Underscored is separate from CNN editorial.\n\nWonder Theory\n\nExplore the universe with news on fascinating discoveries, daring expeditions, breakthrough advancements and more with CNN‚Äôs science newsletter.\n\nArabic Breaking News\n\nArabic language breaking news alerts, in your inbox.\n\nCNN en Espa√±ol: Alertas\n\nCuando sucede algo importante en el mundo, queremos saberlo lo antes posible. CNN en Espa√±ol te env√≠a las noticias a tu correo electr√≥nico para que te enteres primero.\n\nDaily Monday - Friday\n\nCNN en Espa√±ol: Cinco Cosas\n\nPonte al d√≠a cada ma√±ana recibiendo las noticias de CNN en tu correo electr√≥nico. Suscr√≠bete a nuestro newsletter 5 Cosas.\n\nUnlocking the World\n\nCNN Travel is your key to unlocking a world in flux. Get news about destinations opening and closing, stories that inspire future adventure, plus the latest on aviation, food and drink, where to stay and other travel developments. Delivered weekly.\n\nMulti-part Series\n\nUnlocking Italy\n\nCNN Travel‚Äôs eight-part newsletter series (with a bonus finale) adds a slice of dolce vita to your weekends. Get insider intel on Italy‚Äôs best loved destinations, and follow our guidance to the lesser-known regions to plan your ultimate Italy trip.\n\nmultipart series\n\nUnlocking Mexico\n\nCNN Travel‚Äôs four-part newsletter series curates the choices in a country with deep history and a colorful cultural heritage to give you a taste of the superlatives.\n\nmultipart series\n\nCNN en Espa√±ol: Unlocking Mexico\n\nEl newsletter de cuatro entregas de CNN Viajes, ‚ÄúUnlocking M√©xico‚Äù, presenta una selecci√≥n de opciones en un pa√≠s con una historia profunda y un patrimonio cultural vibrante para ofrecerte una probada de lo m√°s excepcional.\n\nWeather Brief\n\nStay updated on extreme weather. Sign up for email alerts from CNN meteorologists and reporters in the field.\n\nseven part series\n\nLife, But Greener\n\nThis limited newsletter series uses data and science to guide you on lifestyle changes to minimize your personal role in the climate crisis ‚Äì and reduce your eco-anxiety.\n\nMulti-part Series\n\nSleep, But Better\n\nWant the best sleep of your life? Sign up for our newsletter series for helpful hints to achieve better sleep.\n\nMulti-part Series\n\nFitness, But Better\n\nEase into a healthy routine with this seven-part fitness guide, backed by experts.\n\nSix Part Series\n\nStress, But Less\n\nChange your relationship with stress. Our six-part newsletter guide will inform and inspire you to reduce stress while learning how to harness it.\n\nEight Part Series\n\nEat, But Better\n\nThis eight-part newsletter series guides you in a delicious expert-backed eating lifestyle that will boost your health for life.\n\nLife, But Better\n\nGet inspired by a roundup on living well, made simple. This newsletter is CNN‚Äôs essential source for information and tools designed to improve your well-being.\n\nmultipart series\n\nAdulthood, But Better\n\nThis multipart newsletter series helps you make more informed decisions around personal finance, career, wellness and personal connections. Find tips and advice for paying off student loans, negotiating your salary, building credit, and more.\n\nSign up and stay in the loop, with CNN premieres, special TV events, and new digital and audio offerings.\n\nIn Case You Missed It\n\nA daily digest of recommended stories unique to you.\n\nCNN Underscored Deals\n\nBe the first to know about sales and discounts. We‚Äôll send you exclusive deals, and coupons on Wednesdays and Fridays.\n\nWe are unable to subscribe you at this time, please try refreshing the page.\n\nYou're subscribed\n\nYou're subscribed\n\nThank you for subscribing. You can now see all your newsletters\n\nWe're unable to subscribe you at this time, please try later.",
    "source": "CNN",
    "date": "2025-07-31",
    "time": "16:36:17",
    "extracted_at": "2025-07-31T16:36:17.915390"
  },
  {
    "url": "https://www.cnn.com/election/2025",
    "title": "Arizona special primary election results live | CNN Politics",
    "description": "This November, two blue states where President Donald Trump gained ground in 2024 will elect new governors — offering a potential preview of next year’s critical midterms. In New York City, voters will choose a mayor to lead the nation’s largest city for the next four years. Plus, special congressional elections this year will impact the balance of power in a closely divided House of Representatives.",
    "full_content": "This November, two blue states where President Donald Trump gained ground in 2024 will elect new governors — offering a potential preview of next year’s critical midterms. In New York City, voters will choose a mayor to lead the nation’s largest city for the next four years. Plus, special congressional elections this year will impact the balance of power in a closely divided House of Representatives.\n\nArizona’s 7th congressional district, which stretches from the Phoenix area south to the Mexican border and includes parts of Tucson, has been without representation since long-time Democratic Rep. Raul Grijalva died in March. Grijalva’s daughter Adelita, a former county supervisor, won the Democratic primary against 25-year-old political content creator Deja Foxx and former state Rep. Daniel Hernandez. She’ll be favored in the September 23 general election against Republican Daniel Butierez.\n\nZohran Mamdani officially clinched the Democratic nomination in the race to become New York City’s next mayor on July 1, pulling off a stunning upset over former governor Andrew Cuomo. While Mamdani, a 33-year-old democratic socialist, had been all but assured to be the party’s nominee after the June 24 primary, he hadn’t won a majority of first-round votes. It took a tabulation of the city’s ranked-choice votes to put Mamdani over 50% he needed to win.\n\nThe field for November’s governor election is already set with Republican Winsome Earle-Sears, Virginia’s lieutenant governor, facing former Democratic Rep. Abigail Spanberger but Democrats picked their nominees for lieutenant governor and attorney general. Republicans already had their nominees for both offices.\n\nDemocratic Rep. Mikie Sherrill defeated a crowded field of challengers, including mayors Ras Baraka of Newark and Steven Fulop of Jersey City to get the chance to replace outgoing Democratic Gov. Phil Murphy. On the Republican side, President Donald Trump’s endorsement helped 2021 nominee Jack Ciattarelli defeat conservative former talk radio host Bill Spadea. In November, Democrats will try to win a third consecutive term in the governor’s mansion, something that hasn’t happened since the 1960s, while Republicans hope to capitalize on their recent gains in the traditionally blue state.\n\nRepublicans won two special Congressional elections in Florida, which were held to replace former GOP Reps. Michael Waltz and Matt Gaetz. While Waltz and Gaetz both won by more than 30 percentage points in November, the special election results were considerably closer.\n\nDane County Circuit Court Judge Susan Crawford won an open seat on the Wisconsin Supreme Court to maintain the court’s 4-3 liberal majority. Crawford easily won the non-partisan race, despite Trump’s narrow 2024 victory in the state. Voters also approved a ballot measure to enshrine the state’s voter ID requirement in the state constitution and reelected the state’s Superintendent of Public Instruction.\n\nSource: Results data via The Associated Press; Projections by CNN",
    "source": "CNN",
    "date": null,
    "time": "16:36:19",
    "extracted_at": "2025-07-31T16:36:19.612723"
  },
  {
    "url": "https://edition.cnn.com/travel/news",
    "title": "Travel News | CNN",
    "description": "© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ‚Ñ¢ & ¬© 2016 Cable News Network.",
    "full_content": "Full content not found",
    "source": "CNN",
    "date": "2025-07-31",
    "time": "16:36:35",
    "extracted_at": "2025-07-31T16:36:35.316255"
  },
  {
    "url": "https://apnews.com/",
    "title": "Associated Press News: Breaking News | Latest News Today",
    "description": "Description not found",
    "full_content": "President Donald Trump listens during a news conference with India’s Prime Minister Narendra Modi in the East Room of the White House, Feb. 13, 2025, in Washington. (Photo/Alex Brandon, File)\n\nBrazil’s former President Jair Bolsonaro points a photo of him during a motorcycle caravan by supporters to protest the Supreme Court trial where he faces charges for alleged involvement in a 2022 coup attempt, in Brasília, Brazil, Tuesday, July 29, 2025. (AP Photo/Luis Nova)\n\nThe faces of Mount Rushmore National Memorial are seen Sept. 21, 2023, in, Keystone, S.D. (AP Photo/David Zalubowski, File)",
    "source": "AP News",
    "date": null,
    "time": "16:36:42",
    "extracted_at": "2025-07-31T16:36:42.496668"
  },
  {
    "url": "https://apnews.com/world-news",
    "title": "World News",
    "description": "Description not found",
    "full_content": "The Gaboa family, Bedouins living in Al-Furaa village in southern Israel, gather around the makeshift bomb shelter they made from two gravel trucks buried in dirt to protect them from incoming Iranian fire, Tuesday, June 17, 2025. (AP Photo/Maya Alleruzzo)",
    "source": "AP News",
    "date": null,
    "time": "16:36:45",
    "extracted_at": "2025-07-31T16:36:45.939040"
  },
  {
    "url": "https://apnews.com/hub/israel-hamas-war",
    "title": "Israel-Hamas war | Breaking News & Live Updates",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "AP News",
    "date": null,
    "time": "16:36:49",
    "extracted_at": "2025-07-31T16:36:49.471377"
  },
  {
    "url": "https://www.theguardian.com/film/2025/jul/31/the-rocky-horror-picture-show-at-50-an-oral-history",
    "title": "‘Everybody was fondling underwater!’: an oral history of the Rocky Horror Picture Show at 50",
    "description": "Mick Jagger wanted to play Frank-N-Furter, Susan Sarandon got pneumonia, and the cast were wet and half-naked most of the time. Richard O’Brien, Barry Bostwick, Patricia Quinn and Nell Campbell tell the surprising, seductive story of cinema’s longest-running cult smash",
    "full_content": "‘Everybody was fondling underwater!’: the Rocky Horror Picture Show at 50 – an oral history\n\nMick Jagger wanted to play Frank-N-Furter, Susan Sarandon got pneumonia, and the cast were wet and half-naked most of the time. Richard O’Brien, Barry Bostwick, Patricia Quinn and Nell Campbell tell the surprising, seductive story of cinema’s longest-running cult smash\n\nThe Rocky Horror Picture Show was released in cinemas in late 1975 with little fanfare, but the provocative musical, with its campy parody of sci-fi and horror B-movies, fabulous costumes and rollicking songs, dug its glittering heels in and refused to let go for the next 50 years.\n\nThe film was an adaptation of the hit musical The Rocky Horror Show, created by Richard O’Brien when he was an unemployed actor. The story of Dr Frank-N-Furter (Tim Curry), an alien, transvestite scientist, decked out like a bewitching glam rock god and hellbent on seducing everyone around him, galvanised audiences into participating in a way that had never been seen before.\n\nAs its popularity grew, audiences began to take an active role in screenings – dressing up, dancing, singing along and adding their own lines of dialogue. Screenings also became safe spaces for LGBTQ+ fans, drawn to the film’s unabashed celebration of queerness, sexual liberation and gender fluidity.\n\nIt remains the longest-running theatrical release in film history and still plays in cinemas today. We look back with the cast and crew to find out how the film became such a cult phenomenon.\n\nThe year was 1974. Actor Richard O’Brien decided to adapt The Rocky Horror Show for the big screen, working with the show’s director, Jim Sharman. They kept most of the original cast but the studio, 20th Century Fox, insisted that the lead couple, Brad and Janet, were recast with Hollywood actors.\n\nRichard O’Brien, co-screenwriter, composer and Riff Raff (a “handyman”)I was approached by Mick Jagger’s people to buy the rights because he wanted to play Frank. I spoke to Jim, and he went: “No, don’t do that.” I said: “Why not?” He said: “Well, that means we won’t be able to make it.” It had never occurred to me that we’d be allowed to. By the time we got to Los Angeles, Lou Adler was the producer, and he made the overture to 20th Century Fox. Suddenly we were allowed not only to make the movie, but all be in it. The kids were allowed into the sweet shop.\n\nJim Sharman, director and co-screenwriterI was given two options. One was a reasonable budget with rock stars and the other one was a tiny budget keeping the original team together. I said: “Great, let’s do that.” I thought it was fine to have Americans playing the Americans, and it was great to have Barry [Bostwick] and Susan [Sarandon], who were, at that time, not particularly known.\n\nBarry Bostwick, Brad (a “hero”, who stumbles across Frank-N-Furter’s castle one stormy night along with his girlfriend Janet, played by Sarandon)\n It was interesting because [Susan and I replacing the original Brad and Janet] was a parallel to the characters coming into a new, strange world. Susan and I stepped into a very vibrant, glam, rocky environment in London. We were fish out of water; naive, wide-eyed and curious.\n\nNell Campbell, Columbia (a tap-dancing “groupie” and Frank-N-Furter’s former lover) \n For [Bostwick and Sarandon] it was definitely a little difficult stepping into, basically, a theatre company because we’d all worked together for at least six months.\n\nPatricia Quinn, Magenta (Riff Raff’s sister and Frank-N-Furter’s “domestic”)Sharman said: “Let’s go around to [associate producer] John Goldstone’s house, and take a look at the sets and the designs.” So I went and saw this pink laboratory set. I saw Transylvanians [Frank-N-Furter’s alien companions] on motorbikes. I saw my dinner dress sketched by Sue Blane, the amazing costume designer, and I said: “Oh, I’m doing this.”\n\nTim Curry, who had cut his teeth in the stage musical as Frank-N-Furter, made his film debut as the sex-crazed, corset-wearing scientist.\n\nBostwick I was enamoured with Tim’s acting chops. To watch him balance the meanness and darkness with the charm and seduction of that character, few people could have done that.\n\nO’Brien When we did it on stage, [Frank-N-Furter] was a bit more German expressionistic theatre, a lot more gothic and ghoulish, and the makeup was rougher. But when we got into the studio, Frank became very glamorous, and it was rather lovely.\n\nProduction started in October 1974, on a budget of $1.4m, for nearly two months – on location in Bray Studios and Oakley Court, a country house in Berkshire, which were both used for Hammer horror films.\n\nSharman We shot at the Hammer Horror studios as a bit of a homage. But that proved to be a little bit impractical. I made many impractical decisions. It was freezing, the middle of winter, the conditions were far from perfect.\n\nBostwick It was a miserable shoot. I was always wet, I was in my underwear, and every 20 minutes, the prop guy was spraying me down with ice-cold water, because they apparently didn’t know how to heat up water in England at the time. So, Susan got pneumonia, and everybody had colds. I remember cursing a lot before scenes when the guy had to come by. At one point, I took the spray and started spraying him, just so he got a taste.\n\nCampbell It was hilariously unglamorous … Mercifully, I had a fantastic silk padded dressing gown which got me through the shoot because we were half naked a lot of the time. We would have to hike to the bathrooms. And we were all being paid a very small amount.\n\nQuinn Everything was a bit of a surprise on this film. Nothing was explained. [The dining table scene didn’t have] anything to do with the play. Tim Curry was told to pull the tablecloth off the table in one fell swoop. Underneath was Meat Loaf [who played Eddie, a motorcyclist murdered by Frank-N-Furter]. I thought: “Oh my God,” because nobody told us. I got hysterics. Richard said to me: “Shut up.” It was hilarious, and it’s all in the film. There was no time to make mistakes.\n\nBostwick The orgy in the swimming pool … We ended up on the stage, wet, in high heels, trying to do the high kicks. It took every bit of balance, energy and camaraderie to do that. Everybody was kissing and fondling underwater. And then when we got out, we went into a little warming booth. We had a cup of tea, and as we were leaving, it caught on fire. Everybody was afraid it was going to burn down the whole set, and we would be shut down. We got out just in time.\n\nThey used an unusual technique to get the opening scene.\n\nQuinn Jim said: “Have you ever seen Man Ray’s Lips, the painting?” “Never.” He said: “We could have your lips miming to Science Fiction.” They [erased] my face completely and painted my lips. I started to do it but the lips kept going out of frame. The lighting guy said: “You see that lamp, that’s clamped in that clamp? Bring it down and clamp her head.” So they brought over [the clamp] and screwed in the top and the sides so I was clamped … The most famous lips in cinema history.\n\nThe intense shoot meant that no one had time to socialise.\n\nO’Brien We were there first thing in the morning at six o’clock. You went home, straight to bed, to get up the next day. We didn’t have time to party.\n\nBostwick I don’t remember having dinner with anybody. I think I got to know the makeup guy better than anybody else … I was experiencing London for the first time. I spent my time at flea markets if I had a day off.\n\nQuinn We were exhausted. I never even got to know Susan. Barry said to me once: “You never liked me.” And I said: “No, I didn’t, because I thought you were Brad” – you know, that dull person. There was no time for chit-chat.\n\nBostwick There was a lot of pot going around in the ranks of the Transylvanians.\n\nThe film flopped on its release in August 1975 and was panned by critics.\n\nO’Brien We had our first viewing of the movie. We all left a little bit depressed. It seemed slow to me. It was a fast 90 minutes on stage. The film seemed more dreamlike, languid. I thought: “God, people should have picked up their cues a bit quicker.”\n\nCampbell It was my big break, so the fact that it disappeared without a trace was very disappointing.\n\nBostwick It never opened in New York. Then I found out later that it hadn’t been a big hit when it opened in London.\n\nThe film was rereleased in midnight screenings in April 1976, with word-of-mouth spreading during its run at New York’s Waverly Theater (now the IFC Center). Fans started to yell out their own responses to lines during screenings, and “shadow casts” dressed up as the characters and lip-synced their own performances in front of the screen. The film was embraced by the queer community, who found a sense of belonging in these immersive screenings.\n\nO’Brien I was at home one day, and someone said to me: “Have you heard about your movie?” I said: “Yes, opened and closed.” “No, it’s doing this midnight business.” That was a surprise.\n\nSharman In a funny way, I felt it would find that audience. Quite irrationally, because there was no reason why it would. But I always felt that there was something special about it. Lou understood the potential and persuaded people at Fox, who had more or less washed their hands of it, to start playing it at late night [screenings]; and so it grew.\n\nQuinn When I was in South Africa, people said it was being banned for corrupting the youth. They said it had been banned in Germany for cannibalism. I thought: “Wow, we’re going to be a hit.” The first Magenta [fan] ever to dress as me became one of my closest friends.\n\nBostwick It started out as a gay event … The audience were outcasts, in a way, from their own society. They found their family there. They found someplace to go and be seen. They were exploring who they were authentically in the world, and they were witnessing something in the film that they had never seen before; that there is an alternative way of being.\n\nCampbell In the beginning, there weren’t that many things [they would call out to the screen]. Now they pretty much call out after every line. The original things were very witty and hilarious. But now – and I know that my fellow cast members agree – it’s too much because you can hardly hear anything without them screaming out.\n\nSharman People said: “Are you horrified that your film is being used as wallpaper for a party?” I said: “No, it’s fantastic.”\n\nSharman and O’Brien teamed up again for Shock Treatment, a loose follow-up to The Rocky Horror Picture Show released in 1981, which featured several of the same characters.\n\nO’Brien The first draft had Rocky (a creature created by Frank-N-Furter and played by Peter Hinwood in the original film) rising from the grave, pulling Frank’s body from the rubble and dragging him back to Dr Scott (Jonathan Adams) to get him reanimated. The producers liked it. Jim said: “No, we’re not doing that.” Everything was reworked and Shock Treatment came up. It’s a flawed piece. I’m not happy with it, truthfully.\n\nSharman I felt Rocky Horror Picture Show was self-contained and resisted the idea of a sequel. Having moved on, I was also cautious about “putting the band back together”. I was, however, keen to work with Richard again. We depicted an America enslaved by reality TV run by a megalomaniac. It didn’t fly – maybe the satire seemed too dark and far-fetched for the time – though it has proved prophetic.\n\nThe Rocky Horror Picture Show went on to gross more than $115m worldwide and is now the longest-running film release in cinema history. It continues to screen around the world.\n\nO’Brien I find it astonishing. People try forever to write something which has legs. It’s like a musical that was written in a 13-year-old boy’s bedroom … [LGBTQ+ fans] come and say that it was something that changed their lives. They found that they weren’t alone, that somehow there was a place for them in the world. They weren’t going to be laughed at, ridiculed.\n\nBostwick I think that my kids, if they have children, will be able to take their children to it and say: “That was your grandfather, and they used to call him ‘asshole’ [a common refrain called out by the audience during fan screenings] for his whole life. But he wasn’t. He was a great dad. He was just associated with this iconic story.” I’m very proud of it, and I’m a champion for its worldviews.\n\nCampbell We’re the only positive cult I can think of. The great joy has been what this film means to so many people. It is still difficult for a lot of people to come out as gay or cross-dressers or bisexual or trans. This 50-year-old film still brings people together because of the shadow casts. I’ve met so many people that have met their partners that way. Sometimes at a screening I will meet an entire family dressed up as the characters. It’s just marvellous.",
    "source": "The Guardian",
    "date": "2025-07-31",
    "time": "16:36:51",
    "extracted_at": "2025-07-31T16:36:51.747464"
  },
  {
    "url": "https://www.theguardian.com/lifeandstyle/2025/jul/31/dont-call-it-morning-sickness-hyperemesis-gravidarum-extreme-pregnancy",
    "title": "Don’t call it morning sickness: ‘At times in my pregnancy I wondered if this was death coming for me’",
    "description": "The Victorians called it ‘pernicious vomiting of pregnancy’, but modern medicine has offered no end to the torture of hyperemesis gravidarum – until now",
    "full_content": "The Victorians called it ‘pernicious vomiting of pregnancy’, but modern medicine has offered no end to the torture of hyperemesis gravidarum – until now\n\nThe year my body revolted, I read all 1,296 pages of War and Peace. I did very little else. My body had become stuck in a perpetual rinse cycle, wringing itself out day and night. Becalmed on the sofa, too nauseated to mindlessly scroll, I found an unlikely emergency exit in the bloody Battle of Borodino. In between puking jags, I would prop the book open on my chest, squint at the tiny text, and drift into a Tolstoy-induced torpor. It occurred to me that clouds of saltpetre and the booming of cannon weren’t ideal conditions for a growing baby, but I had to go somewhere.\n\nAt 6am my husband left for work and I began another gruelling day on the front; purging viscous pond slime from my empty stomach and keeping up with the Cossacks on their flanking march. In the throes of extreme pregnancy sickness, I found strange comfort in the privations of 19th-century military life; in soaked bandages and musket fire and impromptu field hospital amputations. And even, or especially, in the seeming endlessness of the book itself. For the months that I starved, I lugged my starving Russian comrades with me, from the upholstery-chemical stink of the sofa to the sweet bleach-stink of the bathroom to the seamy oily-skin stink of the bed. Perhaps it was a derangement of dehydration and hormones, but I felt real solidarity with my gangrenous friends on the front – far more than with anyone in a “felt cute” sundress on the What to Expect When You’re Expecting app.\n\nWhen the hyperemesis gravidarum began, throwing up 10 to 20 times a day had some degree of novelty. I was thrilled to be pregnant – only five weeks along and high on the discovery – and resolved to pay the price for the construction work my body was doing. “I am creating a whole central nervous system,” I thought, slumped and sweaty on the bathroom floor. But by the time we were on to fingernails and toenails, the adrenaline of the sprint had ebbed away. In the wake of what I imagined to be my martyred maternal heroics was panic. I suspected there were months of relentless nausea and puking still to come.\n\n“Ah, poor pet” was the invariable response of my beatific, noninterventionist midwife when I described another week of struggling to consume enough for my baby and me to survive. “Nasty stuff. Don’t worry – baby will get everything she needs.” This was often followed up with a quick: “It’s just you that will suffer!” as if that were not the sort of problem that needed attention of its own. At one hospital admission after a particularly terrifying Exorcist-style night, the obstetrician told me to let the midwife know that my bump was measuring a bit small. I reported back, but my midwife resented doctors dictating what the pregnant body should and shouldn’t do. “Every bubba grows at its own pace,” she crooned, whisking the measuring tape off my belly.\n\nI asked my mother-in-law if she had gone through anything similar. “Oh no, I never got sick like that,” she said, looking at me sceptically. “Actually, there was one time. I made myself a bacon sandwich and then I just couldn’t face it. I always remembered that, because I love bacon sandwiches.”\n\n“I was so sick, too!” said my mother. “I couldn’t stand the smell of perfume counters. I could only eat beige foods for the first trimester.” I asked how many times a day she threw up, how she survived it. “Oh, I never actually threw up,” she said, “but I did feel just so awful.”\n\nEvery year, up to 3% of pregnant women worldwide are diagnosed with hyperemesis gravidarum, or HG – that is, not the garden-variety morning sickness of the first trimester, but what is considered to be excessive vomiting that can last for the duration of the pregnancy. In parts of China, the rate may be as high as 11%. Worldwide, that’s millions of women at any given moment. Put those numbers together, year after year, and one might suppose we were dealing with a problem of significant public concern. But, dangerously dehydrated, starving, isolated, frequently struggling with suicidal ideation and with barely a treatment protocol in sight, the suffering of these women and their babies has barely registered in the collective consciousness.\n\nNot, that is, until the winter of 2012, when Kate Middleton vanished into a private Marylebone hospital. A medical crisis had been sparked in utero, and the palace was forced to announce the presence of a royal foetus far earlier than it would have liked. Prince George, as the bump would become, had leapfrogged Harry in the line of succession, and initiated a form of “severe morning sickness” in the princess that had the world’s tabloid journalists scrambling over potted summaries of the condition. I happened to read one such summary in the Evening Standard on the tube that afternoon, appalled to think such a scenario could suddenly unfold in a woman’s life. Eight years later, when I arrived at my local public hospital in Australia, 13 weeks pregnant in the midst of a pandemic, it was Kate’s name the nurses were whispering in their triage desk huddle.\n\nLike the millions of non-royals with HG, I was largely left to fend for myself, never knowing when my condition was considered “bad enough” to trouble a hectic emergency department for IV fluids. No blood tests took place to check for nutritional deficiencies (I couldn’t keep down prenatal vitamins), there were no weigh-ins, no extra check-ins, no counsellors and no special clinic to visit. Mostly, I was so weak and disoriented that moving from my huddle over War and Peace would have been too much in any case. And while folk and medical wisdom have been in staunch consensus that “baby gets everything she needs”, even from a mother who can’t keep down so much as a glass of water, troubling new research is emerging which suggests that baby may be suffering far more than we initially thought – and for longer.\n\nThe sternest sceptic may wonder if HG isn’t just a fabulated modern condition – a bid for attention by lily-livered 21st-century women who can’t endure what our forebears did. I had begun to fear something similar. If women had been suffering like this for centuries, surely we – or at the very least, our doctors – would know a great deal about it? The condition resolved entirely once my daughter was born, and the whole pregnancy was becoming increasingly pixellated – happily so. But some unresolved questions still niggled, and I was curious to know if my ancestors had been plagued by HG too.\n\nOne afternoon, while our now four-year-old daughter was serenading my husband with a strangely apposite song by punk icon Patti Smith (“Oh baby, I remember when you were born / It was dawn and the storm settled in my belly”), I decided to dig through the medical archives. I prepared myself to encounter very little – some derisory footnotes about hysteria, perhaps. After all, in 2025, women in rich and poor nations alike still experience major healthcare inequity, and one could hardly expect the gender bias to have been any better at the turn of the 20th century. So I was surprised to find that there were actually many serious, active discussions of what Toronto’s Dr Temple called the “very distressing and, not infrequently, fatal complication of pregnancy” in the top medical journals of the late 19th and early 20th centuries.\n\nIf you scan down the pages of Victorian British Medical Journals – past cases of syphilitic headache, senilic gangrene, tin poisoning from silk stockings, and sunstroke, you will come upon a section called Midwifery and Diseases of Women. It’s here where I discovered many cases of women in mid to late pregnancy appearing “in a dying condition” – as I had often imagined myself —and treated with a wild catalogue of remedies. I could find little coherent methodology or protocol, because although there was huge speculation about the causes, everyone still seemed mystified. More than 100 years before the invention of the twist-and-seal sickbag, women were dying of “pernicious vomiting of pregnancy” in large enough numbers to warrant real concern.\n\nPredictably, some physicians did conceive of it as a nervous complaint. In Berlin, the foreboding Prof Kaltenbach found that threatening a woman with a grisly (and often fatal) surgical termination could often hasten her “recovery”, and was satisfied that HG could be cured by “a process akin to suggestion, like ordinary hysteria”. Some doctors in the 1920s were heavily influenced by nascent psychoanalytic theory, arguing that the vomiting was a “semi-conscious desire to end an unwished-for pregnancy”. But surprisingly, they were in the minority. On the whole, the condition seemed to be treated with far more gravity, attention and care than I encountered myself, more than a century later.\n\nAs early as 1880 – the year that female “hysteria” was first described in the medical literature – a demobbed American civil war surgeon was taking the suffering of his HG patients very seriously indeed. That year, William W Potter (who would definitely earn a grid spot on the Hot Victorians Instagram account) submitted the catchily titled “On rectal alimentation and the induction of abortion for the relief of the obstinate vomiting of pregnancy” to the American Journal of Obstetrics and Diseases of Women and Children. Potter had served as surgeon for the 57th New York, been captured by the Confederates, and “interviewed” by Gen Stonewall Jackson – presumably he had seen his fair share of suffering and gruesome medical scenarios. So the concerned solemnity with which he discussed and treated HG is all the more interesting. And he wasn’t alone. About 50 years before the saline drip was widely available, a number of gentlemen physicians were truly puzzled as to why otherwise healthy women were vomiting themselves into an early grave. Unlike his more laissez-faire 21st-century counterparts in my local hospital, one Glaswegian doctor reported: “A really bad case of hyperemesis is one of the most serious and trying things with which a physician has to grapple, and no time should be lost … if the patient’s life is to be saved.”\n\nThat is “patient” singular. In pointed contrast to the current reality in the US after the reversal of Roe v Wade, in the days of Victorian medicine, a mother’s life was the primary consideration. One can even forget the existence of a second patient, so absent is it from the pages of deliberations and outcomes. Indeed, “emptying the uterus” – the euphemism for a therapeutic abortion – was frequently the treatment for intractable cases. It could be an instantly effective cure for the mother’s condition, bringing respite either in the end of her pregnancy, or the end of her days.\n\n“Relief” could be obtained via the ominous-sounding “Bossi’s dilator”. This was mentioned so many times that I was moved to hunt down a picture. The unholy love child of a whisk and a winged corkscrew, it looked like something a butcher might have on hand for disembowelling deer. A Genoese inventor created the four-bladed tool, which has a tap head on one end for ratcheting, and four giant hinged arms on the other for “rapid dilation”. In this terrifying era of experimental surgery, I became fond of some of the HG heroes, like Dr Fordyce Barker, who “did not believe in the rapid evacuation of the uterine contents”. He had seen two persons die from shock after rapid delivery with the aid of Bossi’s dilator.\n\nBut death wasn’t the only ameliorative on offer. Unlike the modern pregnant woman who may take pains to avoid high-mercury fish, a healthy dose of mercury was a first-line remedy for pernicious vomiting. Far from languishing on the chaise longue without intervention, she could also receive the “rectal instillation” of morphine, laudanum or her own urine; an enema with soap, water and disinfectant; regular doses of adrenaline, arsenic, strychnine or deadly nightshade; an intramuscular injection of her husband’s blood; pessaries of hydrogen peroxide; injections of insulin or corpus luteum (the cells on the ovarian follicle that degrade and trigger menstruation); and regular stomach washes and gluteal injections of milk. Some of the treatments even had a droll regional twist; in Edinburgh there was a “rectal feeding regime” of milk, brandy and “meat juice”; in Texas, an obstetrician made the fabulously bullish declaration: “This author uses a strong solution of cocaine, and uses it in heroic doses.” Where cocaine failed, he also experimented with electric shock treatment, sending current up and down the spine and stomach of his patient. One intrepid physician even used radiotherapy on the lower backs of his pregnant patients, warning that great care should be taken to not overdo it and accidentally initiate an abortion (he adds a breezy postscript that it’s an effective way to terminate a foetus if you need to, though).\n\nAs I scrolled into the 1950s and 1960s, the energetic lists of medical interventions puttered out. There were no more pilot remedies, no worried physicians requesting the livers of HG patients to be sent in waterproof packaging for dissection. In fact, for the next few decades there was very little reference to HG at all. It took a few minutes for me to understand why. Because the word thalidomide never actually appears – only its UK brand-name: Distaval.\n\nThalidomide – the anti-emetic with “no known toxicity and free from untoward side-effects”, was prescribed in the late 50s and early 60s for mothers suffering even the mildest form of morning sickness. The severe birth defects and catastrophic human cost of the thalidomide scandal is well known, but there were other areas of fallout, too. Quite understandably, it not only damaged a woman’s confidence in the assurances of her doctor, but it also dented the doctor’s confidence to prescribe medicines for her patient, and the pharmaceutical companies’ confidence to develop and market medications for pregnant women. First, do no harm, of course. But what about when doing nothing constitutes a form of harm, too?\n\nThalidomide is only one piece of the puzzle. The neglect of millions of pregnant women with HG is a classic example of what policy wonks refer to as a “wicked problem” – a complex, multidimensional issue that resists easy solutions. It’s partly an issue of squeamishness – it’s tricky to build a sympathetic, interesting brand around Monty Python levels of vomiting. When I’ve tried to share some of this suffering with friends and family, the reactions are sometimes awkward and the subject is quickly closed. “At least that nastiness is over,” people will happily sigh, and reach for sunnier topics. But it’s also the name. Hyperemesis gravidarum sounds dreary, but the term “extreme morning sickness” is part of the problem, too.\n\nBecause it’s not just a matter of degree. A bit of polite morning sickness is a cinematic trope; our glowing heroine dashes to the toilet and returns, laughing and shaking her head. But this is not the same as lying bedbound, barely eating or drinking for the entire pregnancy. There’s no socially viable way for the HG sufferer to leap in and correct with her own little anecdotes.\n\nLike the night when I was 24 weeks pregnant and even after chemotherapy-grade nausea medication, vomited so many times in rapid succession that I wondered if this was it, if death was coming for me and my baby both, and rubbery-tasting chunks of something that wasn’t food started collecting in my bucket, and, having lost all control of my bladder, I slid in pools of marbled urine and vomit, trying to focus on breathing in between rounds, and when I continued vomiting – now blood – into the transparent bags in the ambulance, and cried out would the baby be OK, and the paramedic chuckled and said: “Nah, that’s nothing. I’ve seen more blood in vomit!” like he was a Crocodile Dundee cameo in a National Lampoon sketch.\n\nIf one hasn’t experienced it, it is hard to imagine the physical and psychological impacts of starvation and relentless vomiting – up to 50 times a day, for nine months. So studies fill in the gaps: bedsores, atrophied muscles, torn oesophagi, fractured ribs, detached retinas, intracranial haemorrhage, Wernicke’s encephalopathy, broken teeth, collapsed lungs, liver dysfunction, lost jobs and relationships, sterilisations to avoid future pregnancies, long-term PTSD and depression. And death. In 2022, Jessica Cronshaw, a 26-year-old primary school teacher from Lancashire, took her own life when 28 weeks pregnant. Her much-wanted daughter was delivered via C-section and died four days later. In the inquest report, the assistant coroner said the case “should serve as a reminder to healthcare professionals about the critical importance of addressing the wide-ranging impacts of hyperemesis gravidarum, including its mental health aspects.” According to a recent study, as many as 4.9% of women with HG have terminated a wanted pregnancy and more than a quarter have considered suicide as their only option to obtain relief. That’s a staggering number of women, year on year.\n\nLast year, when our daughter was three, my husband came running into the kitchen waving his phone. On the screen, the geneticist Marlena Fejzo smiled out at me from Time’s Women of the Year round-up. Having identified a possible genetic culprit for HG – the hormone GDF15, which is also implicated in cachexia (the vomiting and rapid muscle wastage associated with cancer and chemotherapy) – Fejzo has become HG’s unofficial Avenger, often pictured hovering over a centrifuge in a white coat. The genetic variants she discovered can lead to abnormally low levels of GDF15 prior to pregnancy, which can make one hypersensitive to their surging levels during pregnancy.\n\nFejzo published one of the first studies on developmental delay in babies of HG mothers. “I started looking at some of the outcome studies because the issue didn’t seem to raise enough concern – just the mother’s experience throughout the pregnancy,” Fejzo told me.\n\nShe argues that, far from the “baby gets everything she needs” narrative, HG is actually detrimental to pregnancy. She told me about a study that showed HG mothers were more likely to have small infants than mothers with chronic hypertension, pre-eclampsia and even exposure to cannabis, tobacco, cocaine or amphetamines. There was also evidence of abnormal brain growth, neurodevelopmental delay, vitamin K-deficient embryopathy, autism spectrum disorder, childhood cancer and respiratory disorders.\n\nFejzo’s work on HG treatment and prevention is what she calls the “final chapter” in her own story. But like many classic narratives, it is a breakthrough that tragically comes too late for the protagonist. She had HG in the early 00s, but her doctor said she was exaggerating. With a PhD in genetics from Harvard, she was more likely to be believed than many – but still wasn’t. Her doctor said that he’d recently read a study that showed that pregnant women wanted to be infantilised by their mothers. And Fejzo’s retired parents had taken separate shifts to take care of her – to empty her bedpan, among other things. Speaking with her now – an award-winning academic at the top of her field – it’s hard to imagine anyone less likely to be patronised and gaslit. But she was too weak to argue, and lost her baby to chronic starvation in the second trimester.\n\n“People used to say to me that it must be all in your head because animals don’t get it. And so I looked it up and that’s just not true. In veterinary journals, for cats, they say, if the cat doesn’t eat for one to two days, you should immediately call your vet. They’re more proactive about the care of the pregnant cat!” She jokes that a woman with HG would have more luck getting an appointment with a vet, and we both cackle in solidarity. But I think of our former selves, of her incalculable loss, of the Bossi’s dilations and the gaslighting and the hushing and the suicides, and of how neither of us really think it’s funny, not even a bit.\n\nFejzo and I both entered our pregnancies in a position of great privilege – educated, financially secure, able-bodied, relatively healthy women in rich countries, with strong social networks and access to healthcare. If we represent the ability to gain the greatest advantage from a cracked system, then what about those who do not? What about the women who don’t feel able to make demands or argue with their healthcare providers, or who lack the language to do so? There is evidence that Black and Asian women are already the victims of bias in their healthcare, including in pregnancy. What about those women, and the women who live in poverty and are nutrient-deficient at the start of their pregnancies, or the new migrants who live a distancefar from family, or the women who can’t take time off work, or the women in the global south?\n\n“HG is the fourth leading cause of maternal death in Botswana,” Fejzo tells me, “and that’s just where we happen to have some data.”\n\nStudies and trials based, in part, on Fejzo’s research are under way now, using drugs that increase levels of GDF15 prior to pregnancy in order to desensitise the patient, and those that block GDF15 signalling during pregnancy itself. But developing drugs for pregnant women is a long and complicated process, so an over-the-counter treatment based on Fejzo’s research is still a way off.\n\nPeople tend to misunderstand the furore around medicalised misogyny and bias. They imagine arrogant male doctors wilfully and deliberately dismissing female patients, which is rarely the case. They exist, of course, but there are very few doctors who deliberately pursue a “women’s health is not important” policy, and no one enters medicine in order to mistreat and misdiagnose 50% of the population. Bias is very often unconscious, because most of us are not aware of the ways in which our core beliefs and expectations might exclude others or diminish their concerns. But research from a number of sources shows that women not only wait up to 33% longer in emergency rooms than men with the same symptoms, they are also more likely to be turned away in the middle of a stroke or cardiac event, and have to push harder and longer (sometimes years longer) to get a cancer diagnosis. But increased awareness of this disparity hasn’t changed it.\n\nWomen have internalised some of these biases, too. Girls growing up within a patriarchal framework absorb certain ways of thinking about their bodies and their identities. That includes female doctors and nurses, holistic midwives and female patients. Periods are meant to be excruciating. Pregnancy is meant to be gruelling. Mothers’ bodies are meant to be exhausted. Menopause is meant to be debilitating. Was there a gendered dimension to my not wanting to keep causing a fuss in the emergency room? A determination to struggle along silently because I was accustomed to doing so? It’s not unrealistic to imagine that HG research and treatment would be a priority if men suffered with it.\n\nHyperemesis gravidarum is an extreme type of suffering for women – torture even, that we turn a blind eye to. Now we know it was never true that only the mother suffered, but why did we think that made it OK in the first place? But there is some hope, and it has just been published in the same journal – renamed – where I discovered my civil war hero and his treatise on rectal alimentation. At the end of June, Fejzo and her colleagues published a new study that found that daily use of an affordable GDF15-increasing drug prior to pregnancy is associated with a greater than 70% reduction in the risk of HG. Metformin is mainly prescribed to lower blood sugar in patients with type 2 diabetes, but it has recently been touted as a “wonder drug” that may have many more applications. It is heartening and galling to think the solution may have sat on the shelves of my local pharmacy all this time. While more studies are needed, Fejzo’s work suggests generations to come may no longer have to suffer like we and our ancestors did.\n\nAs it says on the tin, War and Peace is not all cannon fire and amputations – there’s a lot of peace in it, too. All’s Well That Ends Well was its working title, and on re-reading, I remember that children fill the epilogue. We leave the surviving characters in the bosom of their families, dandling “the baby in his little hat, with his wobbly head” and remarking on the redemptive sweetness of their children. Natasha finds that “no one could tell her anything so soothing and sensible as this little three-month-old being, when he lay at her breast and she felt the movement of his mouth and the puffing of his nose”.\n\nI joke now that the pregnancy was only so hard because I was hatching somebody so spectacular. I would do that pregnancy again, in every possible universe. My daughter has memorised all of the lyrics to that Patti Smith song about the tempestuous birth. I’ve sung it to her since she was born, subbing her name for Kimberly’s and ratcheting to the middle-eight like a rollercoaster. Now we sing it together in the car, in the living room, outside in the garden, getting louder as we inch toward the big payoff. “The palm trees fall into the sea / It doesn’t matter much to me / As long as you’re safe, Kimberly”.\n\nOne of my first duties as a new mother was to keep my child safe as she grew in my belly. But did I? I am haunted by the idea that, in minimising my own suffering, I minimised hers, too. If I had known her then, or Marlena Fejzo, or William W Potter, I would have dragged us to that hospital, day after day, and demanded the care we deserved.",
    "source": "The Guardian",
    "date": "2025-07-31",
    "time": "16:36:53",
    "extracted_at": "2025-07-31T16:36:53.200753"
  },
  {
    "url": "https://www.theguardian.com/travel/2025/jul/31/10-of-the-best-secret-gardens-green-spaces-parks-europe-major-cities",
    "title": "10 of the best secret gardens in Europe’s major cities",
    "description": "From Paris to Athens, we pick hidden havens to escape the summer heat and tourist crowds",
    "full_content": "10 of the best secret gardens in Europe’s major cities\n\nFrom Paris to Athens, we pick hidden havens to escape the summer heat and tourist crowds\n\nEl Capricho Park, Madrid\n\nEl Capricho, on the outskirts of Madrid, is one of the city’s lesser-known parks. It was built in 1784 by the Duke and Duchess of Osuna, and visited by 18th-century artists such as Francisco de Goya. Its 17-hectare gardens were designed by Jean Baptiste Mulot, who also worked on the Petit Trianon gardens at the Palace of Versailles. They are in three sections: Italian, French and English landscape. The park also has a small lake, a labyrinth, a bandstand and a mansion. One fascinating feature is an underground bunker, built in 1937 during the Spanish civil war – there are free guided tours at weekends.Open weekends and public holidays, 9am-9pm, April to September, then 9am-6.30pm, October to March, esmadrid.com\n\nOnion Garden, London\n\nYou’re never far from a garden in London: 20% of the city is public green space, including about 3,000 parks, and it became the world’s first National Park City in 2019. As well as eight royal parks and vast areas of greenery such as Hampstead Heath, the city has numerous hidden havens. One of them is the tiny Onion Garden near Victoria Station and St James’s Park. According to the tour guide Jack Chesher, it was a “derelict concrete corner” until late 2021, when it began to be transformed into the “hanging gardens of Westminster”. The pocket park now has more than 200 species of plants – including a fair few onions – and displays artworks such as mosaic wall art and sculptures. There is a cafe and events including singing, craft workshops and poetry recitals.Open weekdays 7.30am-5.30pm (until 10pm on Thursdays), weekends 8.30am-4.30pm, theoniongarden.org\n\nAnne Frank Garden, Paris\n\nThis little-known walled garden, found down a dead-end road in the Marais, once belonged to the Hotel de Saint-Agnan. The hotel is now the Musée d’Art et d’Histoire du Judaisme (mahJ), and the garden, dedicated to Anne Frank, is open to the public. The central plot dates to the 17th century, and there is a small orchard, vegetable garden, pergola and children’s play area. Most moving is the chestnut tree, planted in 2007 from a graft of the tree Anne looked at from her window in Amsterdam and wrote about in her diary. As well as the mahJ, the Pompidou Centre is a short walk away. Open 10am-9pm in summer, paris.fr\n\nBrera Botanical Garden, Milan\n\nHidden behind the south wall of the Palazzo Brera in the centre of Milan is an ancient medicinal garden. Humiliati priests grew plants and meditated here in the 14th century, followed by the Jesuits. In 1775, Empress Maria Theresa of Austria ordered it be turned into a botanical garden, and it has been managed by the University of Milan since 1935. The 5,000sq m garden still has its original layout: two oval ponds; an arboretum containing two centuries-old Ginkgo biloba trees and other exotic specimens; and themed flowerbeds (medicinal, Mediterranean, plants used for dyeing, textiles, paper …) Open 10am-6pm, Monday to Saturday, until 31 October, then 9.30am-4.30pm, until 31 March, ortibotanici.unimi.it\n\nCentralbadets Garden, Stockholm\n\nRight in the middle of Stockholm, off the main shopping street of Drottninggatan, is a hidden courtyard garden. In the 18th century, it was the garden of the farm where the architect Carl Hårleman lived – two of the pear trees are thought to date from this period. Another architect, Willhelm Klemming, bought the property in 1901, renovated the garden and built the Centralbadets in 1904 – still an affordable day spa today. The lush little garden has a pond with a water sculpture, flowerbeds, winding paths and shady places to sit. There are three adjacent restaurants, all with outdoor tables.Closed at night, parker.stockholm\n\nThe Garden of the Royal Library, Copenhagen\n\nHidden between Christiansborg Palace and the Royal Library in a historic part of central Copenhagen is a tranquil public garden. The garden was built in 1920 on top of Tøjhushavnen, an old naval port. Reminders of this maritime past include a pond in the middle of the garden, with an eight-metre-high column that shoots a spout of water every hour on the hour, and an old mooring ring at one end. There is also a statue of the Danish philosopher Søren Kierkegaard, whose manuscripts are in the library’s collection and occasionally go on display. There are benches under the trees to sit quietly with your own book.Open 6am-10pm year-round, visitcopenhagen.com\n\nKárolyi-kert, Budapest\n\nTucked away in the palace district, the Károlyi-kert is thought to be Budapest’s oldest garden, and contains Hungary’s oldest mulberry tree. It was once the private garden of the Károlyi Palace, and has been a public park since 1932 (don’t be deterred by the forbidding-looking iron railings). It is a mix of styles: geometric central flowerbeds and fountain, and English-style paths and plant arrangements. There is a children’s playground and a statue of a beloved late resident: Károly, a Belgian giant rabbit. The wine bar and restaurant Csendes Társ is next to the park and has outdoor tables right outside the gate.Open 8am-9pm in summer, welovebudapest.com\n\nUniversity Library Roof Garden, Warsaw\n\nThe landscaped garden on top of the University of Warsaw’s library is one of the biggest roof gardens in Europe, at more than a hectare (2.5 acres). It opened in 2002 and remains a little-known escape from the busy Powiśle district. A gentle slope leads to the lower garden, which has a duck pond and a series of granite sculptures. The upper garden is divided into four colourful sections: gold, silver, red and green. The areas are connected by paths, bridges and pergolas, and a cascading water feature joins the upper and lower parts. The garden has panoramic views of the Warsaw skyline.Upper garden open from April to October, lower garden open year-round, en.uw.edu.pl\n\nVrtba Garden, Prague\n\nAlthough it is close to sights such as Charles Bridge and Lesser Town Square, this terraced garden on Petřín hill is hard to find. Visitors who seek it out are rewarded with baroque beauty. The Italianate garden was created around 1720 on the site of Vrtbovský Palace’s former vineyards. Three terraced platforms, connected by steps, are full of hornbeams, yews, and tens of thousands of flowers and shrubs. The gardens are decorated with statues, vases and paintings, and a ceremonial lighting event is held twice a year. From the pavilion on the top terrace, there are views of the castle, cathedral and old and new towns.£5 adults/£4 children/£15 families, open 10am-7pm, April to October, prague.eu\n\nDiomedes Botanical Gardens, Athens\n\nThe National Garden in central Athens is a well-known attraction, but the city also has a lesser-known botanic garden, a 20-minute bus ride away. Most of this vast, 186-hectare (460-acre) green space is left as a natural habitat, but 11% (about 20 hectares) is cultivated and contains more than 2,500 plant species. Visitors can walk through the arboretum, with trees from most continents; the ornamental plants section, with 15 flowerbeds and 25 ponds; the historic plants sections, with species recorded by ancient Greeks; and many more – medicinal and aromatic plants, plants of economic importance, hothouse plants, rare plants … There is also a small cafe.Open weekdays 8am-2pm, weekends and holidays 10am-3pm, closed in August, diomedes-bg.uoa.gr",
    "source": "The Guardian",
    "date": "2025-07-31",
    "time": "16:36:54",
    "extracted_at": "2025-07-31T16:36:54.981358"
  },
  {
    "url": "https://www.foxnews.com/",
    "title": "Fox News - Breaking News Updates | Latest News Headlines | Photos & News Video",
    "description": "This material may not be published, broadcast, rewritten, or redistributed.\n                ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or\n                delayed\n                by at least 15 minutes. Market data provided by Factset. Powered\n                and implemented by FactSet\n                  Digital Solutions. Legal Statement. Mutual Fund and\n                ETF data provided by Refinitiv Lipper.",
    "full_content": "",
    "source": "Fox News",
    "date": null,
    "time": "16:36:57",
    "extracted_at": "2025-07-31T16:36:57.619128"
  },
  {
    "url": "https://nation.foxnews.com/?cmpid=org=nat::ag=owned::mc=fnc_display::src=fnc_web::cmp=brand::add=toprail",
    "title": "FOX Nation- Geographic Restriction",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "Fox News",
    "date": "2025-07-31",
    "time": "16:36:58",
    "extracted_at": "2025-07-31T16:36:58.903082"
  },
  {
    "url": "https://radio.foxnews.com/",
    "title": "FOX News Radio",
    "description": "Description not found",
    "full_content": "The Brian Kilmeade Show\n\nFox Across America w/ Jimmy Failla",
    "source": "Fox News",
    "date": "2025-07-31",
    "time": "00:00:00",
    "extracted_at": "2025-07-31T16:37:02.796607"
  },
  {
    "url": "https://www.nbcnews.com/news/us-news/trump-tariff-south-korea-witkoff-gaza-crisis-morning-rundown-rcna222157",
    "title": "Trump reaches tariff deal with South Korea and Witkoff addresses Gaza crisis: Morning Rundown",
    "description": "Morning Rundown: Hunger crisis in Gaza reaches ‘tipping point,’ Trump’s last-minute tariff deals, and why app stores may soon check your age",
    "full_content": "Donald Trump has announced tariff rates for several countries as his Friday negotiation deadline nears. Pressure to address the humanitarian crisis in Gaza builds. And why some states are passing laws requiring app stores to ask for a user's age.\n\nHere’s what to know today.\n\nTrump announces tariff deals as deadline approaches\n\nPresident Donald Trump has announced last-minute trade agreements with South Korea and Pakistan, just a day before his Aug. 1 tariff deadline.\n\nThe president said South Korean imports would face a 15% tariff after the country made \"an offer to buy down\" the 25% duty level he had previously set.\n\nTrump said South Korea would give $350 billion \"for investments owned and controlled by the United States,\" and $100 billion of liquefied natural gas \"or other energy products.\" South Korean President Lee Jae-myung confirmed the agreement yesterday evening.\n\nThis is Morning Rundown, a weekday newsletter to start your day. Sign up here to get it in your inbox.\n\nThis morning, the United States and Pakistan said they had clinched a deal that Islamabad described as leading to lower tariffs on its exports, while Trump trumpeted a pact to help develop the South Asian nation’s oil reserves. Neither mentioned the tariff rate agreed.\n\nThe president yesterday said imports from India face a hiked tariff rate of 25%, along with an unspecified penalty for what he said was an over-reliance on Russian energy and military equipment.\n\nU.S. tariffs on goods from Brazil will be raised from 50% to 90%, Trump said, as his administration sanctioned the judge overseeing the cases for former President Jair Bolsonaro for allegedly plotting a coup.\n\nTomorrow marks a trade negotiation deadline that Trump said “stands strong” and “will not be extended,” months after he initially threatened tariffs on April 2, a day he deemed “Liberation Day.”\n\nAs tariff rates are paid by those importing goods to the U.S., higher tariffs make it nearly certain that American households will pay higher prices for the everyday goods that are made overseas. American consumers face an effective tariff rate of 18.2%, the highest since 1934, translating to a loss of as much as $2,400 per household in 2025, according to the Yale University Budget Lab.\n\nTrump’s tariff plan is headed to court today, where a panel of 11 judges in New York will hear arguments from the administration, as well as two small businesses that say many of his import duties are illegal. The businesses argue that Trump’s use of the International Emergency Economic Powers Act of 1977 was illegal and that he has “no authority to issue across-the-board worldwide tariffs without congressional approval.” All of Trump’s tariffs on major trading partners, including Canada, Mexico, and several other countries, have been deployed using the law.\n\nMeanwhile, the Federal Reserve left its key interest rate unchanged, though two Trump-appointed board officials dissented from the decision, which has not occurred in more than three decades. Fed Chair Jerome Powell said that while the economy remains solid, it’s too early to tell how tariffs will affect it.\n\nRead the full story here.\n\nMore politics news:\n\nHunger in Gaza reaches 'tipping point'\n\nExperts and advocates say the hunger crisis in Gaza has reached a “tipping point,” with deaths expected to soar if Palestinians do not get urgent relief. And the children who do survive malnutrition will face lifelong consequences.\n\nThe “window to prevent mass death is rapidly closing, and for many it’s already too late,” said Kiryn Lanning, senior director of emergencies of the International Rescue Committee (IRC), a U.K.-based humanitarian organization. The World Health Organization warned that the “health and well-being of an entire future generation” was at stake.\n\nDoctors and aid workers inside Gaza, themselves overworked and underfed, have been warning for months about the critical lack of food and the spiraling cost of the little that was available due to Israel’s offensive and crippling aid restrictions. They say that their worst fears are coming to pass.\n\nTrump’s special envoy, Steve Witkoff, will travel to Israel today to address the humanitarian crisis in Gaza, a senior official said, as some of the president’s Republican allies and many Democrats call on him to expand food assistance to the enclave and put more pressure on the Israeli government to reach a ceasefire deal. Witkoff pulled his negotiating team from Doha, Qatar, last week after he said the latest response from Hamas showed “a lack of desire to reach a ceasefire.”\n\nWitkoff’s trip to the Middle East comes a day after Canada said it plans to recognize a Palestinian state in September, joining the U.K. and France in making a symbolic announcement signaling a broader shift against Israel’s policies. “The level of human suffering in Gaza is intolerable,” Canadian Prime Minister Mark Caney said.\n\nTrump has been more outspoken this week about the crisis in Gaza. Since Israel announced a “tactical pause” in military operations in Gaza last weekend, more than 320 trucks of aid have been collected and distributed by the U.N. and other international organizations, and at least 260 trucks were in Gaza, according to the Israeli military. Read the full story here.\n\nHow a Harvard initiative studying the Israeli-Palestinian conflict collapsed\n\nThe Harvard Divinity School’s Religion and Public Life program was launched five years ago with the goal of advancing the “public understanding of religion in service of a just world at peace.” The program ran annual trips to Israel and the occupied West Bank, a reason several students said they joined the school.\n\nBut the trip and a related course on the Israeli-Palestinian conflict were put on pause in March amid what the school described as “substantial adjustments” to Religion and Public Life. All three of the program’s leaders and most of its staff have left or not had their contracts renewed amid internal and external allegations of antisemitism against the program. Religion and Public Life will continue to operate under new leadership this fall, but with vast changes.\n\nThe program’s gutting comes at a critical time, when Harvard has been accused by the Trump administration of failing to root out antisemitism and threatened with a loss of federal funding. However, public scrutiny predates the current presidential term.\n\nFormer faculty of the program, speaking publicly for the first time, shed light on how it fell apart — and what it could portend for the future of free speech on campuses. Read the full story here.\n\nRead All About It\n\nStaff Pick: Why Apple or Google may soon ask your age\n\nKids’ safety online has gotten a lot of attention recently. There has been a congressional debate over legislation, state laws about social media age limits and a Supreme Court ruling on age checks for pornographic websites. But in speaking with sources, I heard about an under-the-radar trend: the idea of putting app stores on the hook for verifying people’s ages.\n\nThree states have passed laws that, starting next year, would require companies like Google and Apple to ask people’s ages when they create app store accounts. Singapore has done the same. The issue has split the tech industry into warring factions, and civil liberties advocates say these laws will put another nail in the coffin of a free internet. — David Ingram, tech reporter\n\nNBC Select: Online Shopping, Simplified\n\nPickleball can be incredibly addicting and fun, but make sure you lace up with the proper footwear or else you could risk injury. These shoe options for men and women will keep your feet and ankles well protected. Plus, more than 600,000 Frigidaire mini fridges have been recalled — here’s what to know.\n\nSign up to The Selection newsletter for hands-on product reviews, expert shopping tips and a look at the best deals and sales each week.\n\nThanks for reading today’s Morning Rundown. Today’s newsletter was curated for you by Elizabeth Robinson. If you’re a fan, please send a link to your family and friends. They can sign up here.\n\nElizabeth Robinson is a newsletter editor for NBC News, based in Los Angeles.",
    "source": "NBC News",
    "date": "2025-07-31",
    "time": "00:00:00",
    "extracted_at": "2025-07-31T16:37:04.860418"
  },
  {
    "url": "https://www.nbcnews.com",
    "title": "NBC News - Breaking News & Top Stories - Latest World, US & Local News",
    "description": "Hunger in Gaza reaches 'tipping point' as children face lifelong impacts",
    "full_content": "Morning Rundown: Hunger crisis in Gaza reaches ‘tipping point,’ Trump’s last-minute tariff deals, and why app stores may soon check your age\n\nThere are no new alerts at this time\n\n© 2025 NBCUniversal Media, LLC",
    "source": "NBC News",
    "date": null,
    "time": "16:37:06",
    "extracted_at": "2025-07-31T16:37:06.632444"
  },
  {
    "url": "https://www.nbcnews.com/us-news",
    "title": "U.S. News: Latest Breaking Stories, Video, and Photos on American Politics, Economy, and Society",
    "description": "Morning Rundown: Hunger crisis in Gaza reaches ‘tipping point,’ Trump’s last-minute tariff deals, and why app stores may soon check your age",
    "full_content": "Morning Rundown: Hunger crisis in Gaza reaches ‘tipping point,’ Trump’s last-minute tariff deals, and why app stores may soon check your age\n\nThere are no new alerts at this time\n\nTop stories from around the country.\n\n© 2025 NBCUniversal Media, LLC",
    "source": "NBC News",
    "date": null,
    "time": "16:37:08",
    "extracted_at": "2025-07-31T16:37:08.250103"
  },
  {
    "url": "https://www.cbsnews.com/",
    "title": "CBS News | Breaking news, top stories & today's latest headlines",
    "description": "Description not found",
    "full_content": "Trump's tariffs poised for major test before federal appeals court\n\nThe Trump administration asked the court to review a trade court's decision invalidating the president's 10% tariffs.",
    "source": "CBS News",
    "date": null,
    "time": "16:37:11",
    "extracted_at": "2025-07-31T16:37:11.377979"
  },
  {
    "url": "https://www.cbsnews.com/us/",
    "title": "U.S. News: Latest news, breaking news, today's news stories updated daily from CBS News",
    "description": "Description not found",
    "full_content": "Majority of ICE arrests in Trump's first 5 months were in these states\n\nStatistics indicate Texas saw nearly a quarter of all ICE arrests during President Trump's first 5 months in office. About 11% of arrests occurred in Florida and 7% in California.",
    "source": "CBS News",
    "date": null,
    "time": "16:37:12",
    "extracted_at": "2025-07-31T16:37:12.989607"
  },
  {
    "url": "https://www.cbsnews.com/news/tsunami-wave-hawaii-8-8-earthquake-russia/",
    "title": "Tsunami risk appears to pass for U.S. after massive Russian earthquake; South American countries issue new warnings",
    "description": "Description not found",
    "full_content": "One of the strongest earthquakes ever recorded struck Russia's Far East early Wednesday, sending tsunami waves into Hawaii, the U.S. West Coast and Japan. Several people were injured, none gravely, and no major damage has been reported so far.\n\nThe 8.8 magnitude temblor struck off the coast of the Kamchatka Peninsula, an isolated strip along the Pacific Ocean, overnight. Residents of the peninsula fled inland as 16-foot waves caused flooding.\n\nImmediately after the earthquake, Hawaii issued a tsunami warning and evacuation orders, but by Wednesday morning, the warning was downgraded to an advisory and evacuation orders were lifted on the Big Island and Oahu. Japan's Meteorological Agency also lowered its alerts to advisories.\n\nHawaii emergency officials gave an all-clear by the afternoon and canceled the the tsunami advisory. The alerts remained in effect along Japan's east coast and southern islands.\n\nStates on the U.S. West Coast were placed under a tsunami advisory that remained in effect until Wednesday morning. Many of the warnings in California had been lifted by Wednesday afternoon, with just an area near the California-Oregon border and Ripped Point, in the southern part of the state, under an advisory.\n\nU.S. Secretary of Homeland Security Kristi Noem said the worst was over.\n\n\"We were fully deployed and ready to respond if necessary but grateful that we didn't have to deal with the situation that this could have been,\" she told reporters in Chile, where she is meeting officials.\n\nAlerts along South America's Pacific coast, including Chile, forced evacuations and closed beaches.\n\nExperts had warned earlier that the effects of the earthquake may continue through Wednesday.\n\n\"A tsunami is not just one wave,\" said Dan Snider, the tsunami warning coordinator with the National Tsunami Warning Center in Alaska. \"It's a series of powerful waves over a long period of time. Tsunamis cross the ocean at hundreds of miles an hour — as fast as a jet airplane — in deep water. But when they get close to the shore, they slow down and start to pile up. And that's where that inundation problem becomes a little bit more possible there.\"\n\n\"In this case, because of the Earth basically sending out these huge ripples of water across the ocean, they're going to be moving back and forth for quite a while,\" which is why some communities may feel effects longer, he said.\n\nHawaii sees minor flooding and small waves\n\nThe Pacific Tsunami Warning Center, which lifted the Hawaii warning, had forecast that the estimated arrival time of the first tsunami waves there would be 7:17 p.m. Tuesday local time (1:17 a.m. Wednesday ET). Officials urged people to move inland and shelters were opened in many parts of Hawaii. Hawaii Gov. Josh Green said that Black Hawk helicopters had been activated and high-water vehicles were on standby in case authorities needed to conduct rescue operations.\n\nSo far no damage has been recorded, but it will take two to three hours of observation before authorities will be able to determine whether the event has passed, Green said.\n\nGreen said data from Midway Atoll, a small island between Japan and Hawaii, measured waves that were about 6 feet from peak to trough. He warned that waves hitting Hawaii could be bigger or smaller.\n\nCars jammed streets and highways in Honolulu, even in areas away from the shore, as people tried to evacuate. Jimmy Markowski, who was visiting Honolulu's Waikiki Beach, said that the roads on the island were packed.\n\n\"We decided to go to elevated ground,\" Markowski told \"CBS Mornings.\" \"We passed a few other gas stations, you couldn't even get in 'em.\"\n\nCBS Honolulu affiliate KGMB-TV reported that the first waves coming ashore were relatively small, though they came at high tide. Flooding was reported in numerous shoreline areas, including parking lots and boat harbors.\n\nThe PTSC said the Hilo, Hawaii, gauge recorded a tsunami height of 4.9 feet relative to normal sea levels and the Kahului, Maui, gauge recorded a tsunami height of 4 feet.\n\nAt around 10 p.m. local time, Pacific Tsunami Warning Center director Chip McCreery said wave heights appeared to have peaked.\n\nWest Coast feels some effects\n\nThe Oregon Department of Emergency Management said on Facebook at around 3 a.m. local time that small tsunami waves were expected along the coast and urged people to stay away from beaches, harbors and marinas and to remain in a safe location away from the coast until the advisory is lifted.\n\n\"This is not a major tsunami, but dangerous currents and strong waves may pose a risk to those near the water,\" the department said.\n\nA tsunami warning was posted for a portion of the California coast near the border with Oregon. It was later lowered to an advisory. California Gov. Gavin Newsom posted a statement on X saying the state's Office of Emergency Services was coordinating with local officials in Northern California, from Cape Mendocino to the Oregon border.\n\nBy Wednesday afternoon, most advisories along the California coast were lifted. The alert for Washington state was also lifted.\n\nDr. Lucy Jones told CBS News Los Angeles that experts with the National Oceanic and Atmospheric Administration were predicting waves of about a foot for most of Southern California.\n\nCheck out this time lapse of the Pillar Point Harbor in Half Moon Bay. Notice the abrupt up and down motion of the boats. A tsunami is not just one wave. It's a packet of waves that can last for several hours. This rapid surging of water can create dangerous currents.#tsunami pic.twitter.com/qu5joaFgLG\n\nThe National Weather Service said on X that tsunami waves arrived in Monterey around 12:48 a.m. PT. Other cities along the California coast reported small to moderate-sized tsunami waves. A video shared by the National Weather Service Bay Area showed boats bobbing up and down in a harbor as they were rocked by small tsunami waves.\n\nThe National Weather Service in Eureka, California, said around 4 a.m. local time that Crescent City had seen tsunami waves of about 3.5 feet, with activity building as the region approached a minor high tide. High tide could lead to more flooding. Crescent City has seen dozens of tsunamis since the 1930s, including a 1964 event that killed 11 people and destroyed hundreds of buildings.\n\nThe National Weather Service Bay Area warned that even if the waves are small, they can cause \"seriously dangerous\" currents. The first waves also may not be the highest, the agency said, warning people to avoid coastal areas until told it's safe.\n\nOn Alaska's Aleutian Islands, officials recorded waves up to 1.4 feet above tide levels.\n\nKamchatka sees flooding, volcanic activity\n\nThe quake was centered about 74 miles east-southeast of the Russian city of Petropavlovsk-Kamchatsky, which has a population of 180,000. Multiple aftershocks as strong as 6.9 magnitude followed and experts predict aftershocks of up to 7.5 for at least a month, according to the Russian News agency TASS.\n\nThe temblor appeared to be the strongest anywhere in the world since the 9.1 magnitude earthquake off northeastern Japan in March 2011 that caused a massive tsunami that set off meltdowns at a nuclear power plant. Only a few stronger earthquakes have ever been measured around the world.\n\nEarlier this month, five powerful quakes — the largest with a magnitude of 7.4 — struck in the sea near Kamchatka. The largest was at a depth of 12.4 miles and was 89 miles east of the city of Petropavlovsk-Kamchatsky.\n\nThe Kremlin said regional authorities on Kamchatka were well prepared for the quake. Kremlin spokesman Dmitry Peskov noted that the warnings were issued timely and people were quickly evacuated from dangerous areas. He added that the buildings proved resilient to shocks.\n\nA video released by a Russian media outlet showed a team of doctors at a cancer clinic on Kamchatka holding a patient and clutching medical equipment as the quake rocked an operating room, before continuing with surgery after the shaking stopped. Officials said the doctors will receive decorations.\n\nTsunami heights of about 9 to 13 feet were recorded in Kamchatka. Severokurilsk Mayor Alexander Ovsyannikov said the port in the city was flooded by tsunami waves, washing fishing boats into the sea. He said no major damage was recorded. Authorities on the Kamchatka peninsula lifted the tsunami warning for the area, some 11 hours after the quake hit. Russian authorities said several people were injured, without giving a figure. The risk of aftershocks and waves remains, officials said.\n\nOn Wednesday, lava began to flow from Klyuchevskaya Sopka, the largest active volcano in the northern hemisphere. The 15,584-foot volcano, located in the east of Kamchatka, last erupted in 2023. Observers heard explosions and saw streams of lava on the volcano's western slopes, the Kamchatka branch of the Russian Academy of Sciences' geophysical service said.\n\nScientists have anticipated an eruption, with the volcano's crater filling with lava for several weeks and the mountain spitting out plumes of ash.\n\n\"The Klyuchevskoy is erupting right now,\" the Russian Geophysical Survey said on Telegram, posting photos of an orange blaze on top of the volcano and adding that \"red-hot lava is observed flowing down the western slope. There is a powerful glow above the volcano and explosions.\"\n\nSometimes described as the \"land of fire and ice,\" Kamchatka is one of the most active volcanic regions in the world. It has about 300 volcanoes, of which 29 are active, according to NASA Earth Observatory.\n\nEarthquake sparks international response\n\nThe quake had a preliminary magnitude of 8.0, Japanese and U.S. seismologists said. The U.S. Geological Survey later updated its strength to 8.8 magnitude and a depth of 13 miles.\n\nPeople went to evacuation centers in affected areas of Japan, with memories fresh of the 2011 earthquake and tsunami that caused reactor meltdowns at a nuclear power plant. The tsunami alert disrupted transportation, with ferries, trains and airports in the affected area suspending or delaying some operations.\n\nWaves of about 2 feet were recorded on Japan's northern island of Hokkaido, and at least one person was injured.\n\nJapan's Fire and Disaster Management Agency said nearly 2 million residents are now under evacuation advisories in more than 220 municipalities along the Pacific coast as of midday Wednesday. Japan's Chief Cabinet Secretary Yoshimasa Hayashi said waves could remain high for at least one day, and he urged evacuees to take precautions and stay well hydrated in the summer heat. He told evacuees they might not be able to return home by the end of the day on Wednesday.\n\nNo abnormalities in operations at Japan's nuclear plants were reported on Wednesday. The operator of the Fukushima Daiichi plant, heavily damaged by the 2011 tsunami, said about 4,000 workers are taking shelter on higher ground at the plant complex while monitoring remotely to ensure safety.\n\nChina's Ministry of Natural Resources' Tsunami Warning Center issued an alert for parts of the country's east coast along Shanghai and Zhejiang provinces. The warning forecasted that waves could reach between one to three feet. The provinces are already under an alert as Typhoon CoMay is expected to land in the Zhejiang province on Wednesday.\n\nSome tiny and low-lying Pacific island chains are among the world's most imperiled by tsunamis and rising seas due to climate change. People were urged to stay away from coastlines until any wave surges passed late Wednesday in Fiji, Samoa, Tonga, Federated States of Micronesia and Solomon Islands. Philippine authorities advised people to stay away from the beach and coastal areas.\n\n\"It may not be the largest of waves, but these can continue for hours and expose people swimming in the waters to danger,\" Teresito Bacolcol of the Philippine Institute of Volcanology and Seismology told The Associated Press.\n\nElsewhere, a tsunami of under a foot was forecast to hit parts of Vancouver Island, British Columbia. Mexico's navy warned that tsunami waves will start reaching the northern coast in Ensenada, near California, at around 2:22 a.m. Wednesday local time, and waves could progress along the Pacific coast to Chiapas state, around 7:15 a.m. local time.\n\nIn Chile, tsunami warnings were upgraded to their highest level on Wednesday morning. The alert covers most of the nation's 4,000-mile Pacific coastline. The country's Education Ministry also canceled classes along much of the coast.\n\nColombian officials ordered the complete closure and evacuation of beaches and low-tide areas while maritime traffic was being restricted.\n\nEducation officials in Ecuador canceled classes at schools in the Galapagos Islands as well as communities along the coast.\n\nNew Zealand authorities warned of \"strong and unusual currents and unpredictable surges\" along all coastlines of the South Pacific island nation. The emergency management agency said people should move out of the water, off beaches and away from harbors, marinas, rivers and estuaries.\n\nHow are tsunami probabilities categorized?\n\nThere are four levels of tsunami alerts: warning, advisory, watch and information statement, according to the National Weather Service.\n\nA tsunami warning is the most severe. It means residents should take action due to a coming tsunami that may cause widespread flooding.\n\nA tsunami advisory means there's the potential for \"strong currents or waves dangerous to those in or very near the water,\" according to the NWS.\n\nA tsunami watch advises those to be prepared because a distant earthquake has occurred and a tsunami is possible.\n\nThe lowest level of alert is a tsunami information statement from the NWS, which advises people to \"relax\" since an earthquake has occurred, but there is no threat or it was very far away.",
    "source": "CBS News",
    "date": "2025-07-31",
    "time": "16:37:14",
    "extracted_at": "2025-07-31T16:37:14.436674"
  },
  {
    "url": "https://abcnews.go.com/",
    "title": "ABC News – Breaking News, Latest News and Videos",
    "description": "ABC News followed Christopher Dunn for the last year as he navigates a world unknown after serving 34 years in prison for a crime he did not commit.",
    "full_content": "ABC News followed Christopher Dunn for the last year as he navigates a world unknown after serving 34 years in prison for a crime he did not commit.\n\nStay informed 24/7 with a redesigned home feed, personalized content, and a continuous live news stream.",
    "source": "ABC News",
    "date": null,
    "time": "16:37:17",
    "extracted_at": "2025-07-31T16:37:17.691255"
  },
  {
    "url": "https://abcnews.go.com/Live",
    "title": "ABC News Live - 24/7 live news stream",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "ABC News",
    "date": null,
    "time": "16:37:19",
    "extracted_at": "2025-07-31T16:37:19.707714"
  },
  {
    "url": "https://abcnews.go.com/Video",
    "title": "ABC News – Breaking News, Latest News and Videos",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "ABC News",
    "date": "2025-07-31",
    "time": "16:37:21",
    "extracted_at": "2025-07-31T16:37:21.502176"
  },
  {
    "url": "https://www.usatoday.com/news/nation/",
    "title": "NTSB criticizes FAA for failing to act before fatal Army helicopter collision",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "USA Today",
    "date": null,
    "time": "16:37:23",
    "extracted_at": "2025-07-31T16:37:23.382348"
  },
  {
    "url": "https://www.usatoday.com/news/politics/",
    "title": "Daily Briefing: Pre-2026 redistricting race",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "USA Today",
    "date": null,
    "time": "16:37:24",
    "extracted_at": "2025-07-31T16:37:24.827371"
  },
  {
    "url": "https://www.usatoday.com/story/news/nation/2025/07/31/tsunami-waves-surfing-alerts/85447888007/",
    "title": "The power and allure of the ocean: How surfers eyed the tsunami alerts and wondered",
    "description": "No sooner had the tsunami watch been issued than the text messages began coming in.",
    "full_content": "The power and allure of the ocean: How surfers eyed the tsunami alerts and wondered\n\nCoastal residents sought answers to vital questions: How big would the waves get? How worried should everyone be?And surfers had another question about the tsunami: Can we surf it?\n\nNo sooner had the tsunami watch been issued than the text messages began coming in.\n\nFriends and family wanted to know if I was safe. Would the waves reach me? Should I drive, or even run, to higher ground?\n\nAs a lifelong surfer who currently lives in Southern California, I’m familiar and conversant with hundreds of different types of waves. I’ve traveled to dozens of countries in search of waves.\n\nWaves are why I moved here to this surf-rich stretch of coastline. The ocean gives me energy and allows me a space to relax and unplug from the often harsh storylines I follow.\n\nBut the ocean itself can also be harsh. And on July 29, residents of coastal California, Oregon and Washington scrambled for answers to vital questions: How big would the waves get? How worried should everyone be? Would this be the Western Hemisphere’s version of the 2004 Indian Ocean tsunami, which killed almost a quarter of a million people?\n\nAnd surfers had another question about the tsunami: Can we surf it?\n\nTsunamis aren’t like regular surfing waves\n\nTsunamis aren’t like the regular ocean swells that surfers ride.\n\nThose waves are formed by wind from areas of low pressure over the oceans. That wind spins water molecules into ripples that eventually become waves, morphing into open ocean “swells” that can travel thousands of miles before they break as waves on beaches and reefs.\n\nSurfers monitor weather systems in remote corners of the planet, watching for storms that will push these swells our way. There are color-coded charts on websites stretching out two weeks or more so we can plan our surf sessions. Every serious surfer in California currently knows we’ll probably get a pretty epic south swell from Hurricane Iona and Tropical Storm Keli, both currently spinning away off the coast of Central America.\n\nTsunamis, by comparison, form suddenly and violently.\n\nA monumental shift in tectonic plates under the ocean like the July 29 earthquake off Russia’s Kamchatka Peninsula, which measured a whopping 8.8 magnitude on the Richter scale, immediately displaces vast amounts of water, sending a surge in all directions that can form devastating waves once it reaches shallower water.\n\nRelated: Sirens blare, traffic gridlocks as Hawaii braces for tsunami threat\n\nThink of laying in a bathtub:\n\nIf you blow across the surface of the water, you’ll create little ripples that will lap against the rim of the tub like tiny surfing waves. But if you sit up suddenly, you’ll likely send water splashing across the bathroom floor. That’s your own personal tsunami.\n\nBut let’s get more scientific here. The power and size of waves depends on a combination of factors: The height (or depth) of the swells that produce the waves, measured from peak to trough of each wave traveling across the ocean; the wavelength or “period” of the wave, that is, the distance between each wave peak in a swell; and the steepness of the beach or land that the wave eventually breaks on.\n\nA more gradual shift from deep water to shallow will result in a smaller, less violent wave. By contrast, a sudden shift in ocean depth means waves get pushed up suddenly, forming higher waves. That’s why expert surfers crave waves that break over coral or rock reefs.\n\nScience of waves: How tsunamis are created – and why these massive waves are so dangerous\n\nDespite the dangers lurking below, those waves ( like Oahu’s infamous Banzai Pipeline, or Tahiti’s Teahupo’o where the 2024 Olympic surfing was held) offer steep, ledgy waves known to surfers as “slabs.” Those are the arenas where surfing’s gladiators compete, and they’re a world away from your average “beach break” where beginners learn to surf.\n\nThe x factor with tsunamis is not, as most people probably think, the “height” of the waves.\n\nWhat makes tsunamis so dangerous is often their immense “period” or wavelength — the second part of the wave power equation.\n\nFalk Fedderson, a professor at the Scripps Institution of Oceanography in San Diego, explained why tsunamis are so fundamentally different to “normal” waves:\n\nIf you stand at the end of a long pier and look down at ocean waves when a swell is running, Fedderson said, you’ll typically see the waves or “swells” are around 200 or 250 feet apart. That’s because typically ocean waves have a “period” of between 10 and 20 seconds between waves, he said.\n\nAt the other end of the scale, each day’s tides (which act essentially like one or two monumental, but very slow waves a day) have a period of either 12 or 24 hours.\n\nBetween these two extremes lie tsunamis, which often have periods of 10 or 15 minutes between waves. That means tsunami waves can be thousands of feet apart, but it also means that the volume of water, and the eventual size of the wave, acts very differently to the waves that break most days on the California coast.\n\n“A tsunami can basically concentrate all the energy that was spanning 4,000 meters in deep water — all that energy has to get concentrated into much shallower water, and that's what allows a tsunami to get so big,” Fedderson told me.\n\nPut another way, tsunamis aren’t so much “high,” when they’re in the form of swells in the open ocean. They are, rather, extremely “wide” or “thick.”  At least — that’s my non-scientific way of putting it!\n\nBut are they surfable?\n\nCan you surf a tsunami?\n\nThe University of Hawaii at Hilo says flat out no. That’s because they lack a face. They are “more like a wall of whitewater,” the university says.\n\nThat doesn’t mean we surfers don’t think about these things.\n\nOnce it became clear that whatever was going to hit the California coast was not going to be catastrophic, I have to admit the surfer in me took over from the journalist.\n\nThe surf has been basically flat here in Southern California for a couple of weeks. Small, sloppy, rubbishy waves. I’ve had to run to get a workout instead. I hate running.\n\nOn the evening of July 29, I talked with Chuck Westerheide, a spokesman for San Diego County, and asked whether officials would be patrolling beaches and telling people to keep away. No, he said. The county was under a tsunami advisory — far less serious than a tsunami warning.\n\nNo evacuations. No need to panic.\n\n“Strong currents and a tsunami are possible and waves and currents can kill or injure people who are in the water,” Westerheide said. “But that’s key — people who are in the water.”\n\nAfter that, I sat glued to the surf cameras overlooking Waikiki Beach in Oahu for a few hours. The estimated time for a tsunami from the Kamchatka earthquake came and went. No discernible large, dangerous waves broke on that distinct crescent of beach, which should have seen a tsunami long before California.\n\nI was tempted.\n\nSurf a tsunami? Should I drive down to my old haunt of WindanSea beach in San Diego and paddle out?\n\nFedderson later told me that’s probably a bad idea, though he admitted he’s no expert.\n\n“Um. This goes far beyond the bounds of my expertise, but I don't think so,” he said when I asked him if I should have gone surfing in the dark of night. ”But if the amplitude of the tsunami offshore were one foot — you don't want to be anywhere near the coast.”\n\nThe tsunami amplitude offshore was probably more like an inch, Fedderson said. I likely wouldn't have noticed while out sitting on my board. Still, shivering in the night chill and worrying about sharks for something that may not even lead to a good ride?\n\nGood thing I stayed home.",
    "source": "USA Today",
    "date": null,
    "time": "16:37:26",
    "extracted_at": "2025-07-31T16:37:26.579378"
  },
  {
    "url": "https://indianexpress.com/newsletters/",
    "title": "The Indian Express Newsletter: Subscribe to Indian Express Daily Newsletter, News Subscription Online",
    "description": "Description not found",
    "full_content": "Full content not found",
    "source": "The Indian Express",
    "date": null,
    "time": "16:37:28",
    "extracted_at": "2025-07-31T16:37:28.219366"
  },
  {
    "url": "https://indianexpress.com/section/sports/cricket/live-score/england-vs-india-5th-test-live-score-full-scorecard-highlights-anderson-tendulkar-trophy-2025-enin07312025250830/",
    "title": "India : 36/1(13.0) | IND vs ENG 5th Test Match - Live Cricket Score, Full Scorecard, India vs England National Cricket Team Scorecard, Kennington Oval London",
    "description": "Description not found",
    "full_content": "1-10 (Yashasvi Jaiswal, 3.1 ov)\n\nIND vs ENG 5th Test Match - Live Cricket Score & Match Updates\n\nStay tuned for real-time commentary, ball-by-ball updates, and Live Cricket Score of India National Cricket Team vs England Test Cricket Team 5th Test along with Match Result, Scorecard Updates, Match Summary and Report.\n\nThe 5th  Test between England and India at The Oval, London continues with gripping action. In the 1st innings, India is currently batting at 36/1 in 13.0 overs. At the crease, KL Rahul is unbeaten on 13 (off 36), alongside Sai Sudharsan, who is on 8 (off 34).\n\nWith the ball, Josh Tongue has bowled 3 overs for 0 wickets while giving away 14 runs. Gus Atkinson is also in action, with 6 overs under his name so far and 1 wickets to show for his efforts.",
    "source": "The Indian Express",
    "date": null,
    "time": "16:37:30",
    "extracted_at": "2025-07-31T16:37:30.227020"
  },
  {
    "url": "https://indianexpress.com/article/cities/mumbai/2008-malegaon-bomb-blast-all-accused-acquitted-pragya-thakur-col-purohit-court-reliable-evidence-10160836/",
    "title": "2008 Malegaon bomb blast: special court acquits all 7 accused, says strong suspicion, but not enough to punish them",
    "description": "A special court in Mumbai acquitted all seven accused in the case, including former BJP MP Pragya Thakur and Lt Col Prasad Shrikant Purohit, Thursday, nearly 17 years after a powerful bomb blast in Maharashtra’s Malegaon killed six people and injured more than a hundred.",
    "full_content": "A special court in Mumbai acquitted all seven accused in the case, including former BJP MP Pragya Thakur and Lt Col Prasad Shrikant Purohit, Thursday, nearly 17 years after a powerful bomb blast in Maharashtra’s Malegaon killed six people and injured more than a hundred.\n\nPragya Singh Thakur and Lieutenant Colonel Prasad Purohit, Major (retired) Ramesh Upadhyay, Ajay Rahirkar, Sameer Kulkarni, Sudhakar Chaturvedi, and Sudhakar Dhardwivedi were cleared of all charges, including criminal conspiracy and murder under the Indian Penal Code (IPC) and sections of the anti-terror law, Unlawful Activities (Prevention) Act.\n\nSpecial Judge A K Lahoti, who pronounced all seven not guilty, noted, “Terrorism has no religion. Because no religion can advocate violence”.\n\nSpecial Judge Lahoti said the prosecution failed to provide cogent and reliable evidence, and also failed to establish guilt beyond a reasonable doubt. The special judge said there might be strong suspicion against the accused, but it is not enough to punish them, said the court.\n\nSpecial Judge Lahoti also said the prosecution proved the blast, but failed to establish that a bomb was fitted in the motorcycle. “Conspiracy and meetings also have not been proved. A grave degree of suspicion is established, but not enough to convict them; hence, the court has given them the benefit of the doubt. The interception of calls was not authorised. Both sanction orders to invoke are defective, and the UAPA cannot be invoked,” the court said.\n\nThe court also ordered compensation of Rs 2 lakh to the families of the 2008 Malegaon bomb blast victims, and Rs 50,000 to the injured victims to be given by the government.\n\nThe detailed order of the court is yet to be made available.\n\nOn September 29, 2008, a bomb went off at a chowk in Malegaon, a town known for its power loom industry, about 100 km northeast of Nashik in Maharashtra. The blast, which took place in an area with a sizeable Muslim population, killed six people and injured 100 during Ramzan, the holy month of fasting in Islam.\n\nFrom Maharashtra ATS to NIA\n\nThe Maharashtra Anti-Terrorism Squad (ATS), which took over the investigation from the local police, suspected that an Improvised Explosive Device (IED) had been planted on an LML Freedom motorcycle.\n\nATS suspected that the conspirators had consciously chosen the month of Ramzan and the eve of Navaratri to carry out the bombing, to cause communal rifts and endanger the internal security of the state.\n\nThe National Investigation Agency (NIA) took over the probe in 2011 and filed a chargesheet in 2016, claiming there were shortcomings in the ATS probe. The Central agency recommended that the stringent Maharashtra Control of Organised Crime Act (MCOCA) be dropped from the Malegaon bomb blast case, rendering the confessions taken by the ATS inadmissible as evidence.\n\nIn the chargesheet, NIA also said that due to the passage of time — between 2008 and 2011, when they took over the probe — it was unable to make any recoveries from the spot for forensic examination. Its probe primarily focused on the ATS investigation, first pointing towards the ‘lacunae’ and also in the re-recording of statements of witnesses.\n\nNIA had re-recorded some statements, where the witnesses said that the ATS statements were not proper.\n\nDuring the trial, more than 300 witnesses were examined, of whom around 40 turned hostile, some of whom also claimed that ATS threatened them into giving statements.\n\nThe accused also questioned the ATS probe and, subsequently, the NIA chargesheet, claiming that there was no evidence against them. They said that the conspiracy meetings, as claimed by ATS, were not proved, as none of the witnesses whom ATS claimed had participated or heard the accused speak of taking revenge or executing the plan had supported the prosecution’s case.\n\nSpecial public prosecutors Avinash Rasal and Anushree Rasal submitted that the prosecution had relied on witness statements and technical evidence, such as Call Data Records and voice samples, to prove its case.\n\n“We examined 323 witnesses and technical evidence to record the circumstances of the case. The delay in the trial proved to be a challenge as some witnesses turned hostile and over 30 passed away before the trial commenced,” SPP Rasal said at the end of the trial in April, when the court reserved the order.\n\nThe United States Wednesday sanctioned six India-based companies over their alleged involvement in trade and transportation of Iranian crude oil and petroleum products. The US Treasury said it was the most significant Iran-related sanctions action since 2018, during President Donald Trump’s first administration.",
    "source": "The Indian Express",
    "date": null,
    "time": "16:37:31",
    "extracted_at": "2025-07-31T16:37:31.712468"
  },
  {
    "url": "https://timesofindia.indiatimes.com/web-series/news",
    "title": "News - Web Series - \n\t\t\t\t\t\t\tThe Times of India",
    "description": "You can change your city from here.\n\t                We serve personalized stories based on the selected city",
    "full_content": "You can change your city from here.\n\t                We serve personalized stories based on the selected city\n\n\"I’d cast Jugal Hansraj, Pankaj Tripathi, Kiara Advani as Traitors—they come across as so positive and happy\"- Mukesh Chhabra gets real about betrayal, game play and losing on 'The Traitors'\n\n​Throwback pictures of Sridevi with her family\n\nAugust’s top Hindi OTT releases — A mosaic of memory, myth, and momentum\n\nShekhar Kapur unveils AI-generated Sci-Fi series 'Warlord' featuring organic spaceships and interdimensional love story\n\nShriya Pilgaonkar’s parents Sachin and Supriya Pilgaonkar praise her performance in ‘Mandala Murders’: ‘You elevate every role..’\n\nFirst look of 'Pride and Prejudice' series unveiled\n\n'007: Road To A Million' Series Two to stream from this date, Actor Brian Cox to return as host - Read more\n\nEric Bana's 'Untamed' gets renewed for second season after smashing hit; co-creators guarantee even tougher challenges - Deets Inside\n\n'The Gilded Age' Season 3 Episode 6: Bertha shakes hand with Gladys; John Adams suffers unfortunate demise\n\nResident Alien concludes with season 4; cast reflects on series ending\n\nDid 'Love Island' stars JaNa Craig and Kenny Rodriguez break up? Fans notice sudden changes\n\nJunior Edwards from ‘Swamp People’ passes away; know all about the legendary gator hunter - Report\n\nBeloved South Korean actress Jang Mi Ja passes away at 84\n\nWhen Life Throws Curveballs: Lee Byung-hun's Fierce Comeback in 'No Other Choice'\n\nFive Cherry Tomatoes, One Icon: Park So-hyun's Unbreakable Ritual that Shocks the Scale!\n\n'Aema' first look and trailer dropped: Lee Ha Nee stuns fans with new look - Deets inside!\n\nCha Eun Woo enlistment: Hong Suk Chun cries over idol’s military service - Here’s what happened\n\n‘My Troublesome Star’ first look: Uhm Jung Hwa, Song Seung Hoon, Jang Da Ha and more stun in news posters\n\nSpy x Family chapter 115: Release date, time, and what fans can expect next\n\n‘The Rose of Versailles’ set to premiere April 30: All you need to know\n\nEmma Frost joins 'Marvel Rivals' in season 2: Launch date, trailer highlights, and what fans can expect\n\n‘Witch Watch’ anime set to premiere on OTT: here’s the release date, storyline, cast, and streaming details\n\nNew Anime ‘My Hero Academia: Vigilantes’ to debut on April 7, 2025 – here's when and where to watch\n\n'Ne Zha 2' sets records, takes world by storm\n\nWhen Life Throws Curveballs: Lee Byung-hun's Fierce Comeback in 'No Other Choice'\n\nFive Cherry Tomatoes, One Icon: Park So-hyun's Unbreakable Ritual that Shocks the Scale!\n\n'Aema' first look and trailer dropped: Lee Ha Nee stuns fans with new look - Deets inside!\n\nCha Eun Woo enlistment: Hong Suk Chun cries over idol’s military service - Here’s what happened\n\n​Throwback pictures of Sridevi with her family\n\n'007: Road To A Million' Series Two to stream from this date, Actor Brian Cox to return as host - Read more\n\n‘My Troublesome Star’ first look: Uhm Jung Hwa, Song Seung Hoon, Jang Da Ha and more stun in news posters\n\nAugust’s top Hindi OTT releases — A mosaic of memory, myth, and momentum\n\nFrom Seoul to Moscow: How an Indie Film from Madagascar Stole the Spotlight at the International Film Festival\n\nFrom 'Goat Boy' to Gold Medalist: Korean Relay Star Inspired by 'Descendants of the Sun' Actors\n\n‘Trigger’: Kim Nam-gil on gun violence and conscience — “Peace you get through killing isn’t real..”\n\nKim Hye-ja Ditches Red Carpets for Gardens: A Heartwarming Documentary Experience\n\nWhen Even Superstar Couples Get Stuck in Meeting Madness: The Real Story of Lee Min-jung And Lee Byung-hun\n\nKorean stars take Hollywood by storm: Jung Doo-hong and Choi Soo-young's epic action debut in 'Ballerina'\n\nEric Bana's 'Untamed' gets renewed for second season after smashing hit; co-creators guarantee even tougher challenges - ...\n\n‘Trigger’ lead Kim Nam Gil talks about the string in the show; says “it's about people, not guns” - Find out what he said\n\nShekhar Kapur unveils AI-generated Sci-Fi series 'Warlord' featuring organic spaceships and interdimensional love story\n\nFormer APRIL member first look at ‘The Defects’; fans react to idol’s comeback after 2021\n\nGOT7's Jinyoung eyeing lead role in upcoming Korean drama '100 Days of Lies' - Deets inside\n\nEXO’s Kai is real inspo behind Saja Boys' lead character? Animator spills tea - Read inside\n\n‘Omniscient Reader: The Prophet’; Lee Min Ho and Ahn Hyo Seop choose BLACKPINK Jisoo as their ‘ally’ - comments spark mix...\n\nShriya Pilgaonkar’s parents Sachin and Supriya Pilgaonkar praise her performance in ‘Mandala Murders’: ‘You elevate every...\n\nFirst look of 'Pride and Prejudice' series unveiled\n\n'Trigger' ending explained: From addressing dark aspects of society to the dual perspectives\n\nTen Years Later, Can They Keep Their Promise? Korea's Most Romantic Documentary Promise Goes Viral\n\nKim Young-kwang's shocking 8kg weight loss transformation for 'Trigger' - The truth fans didn't know\n\n'Iron Girls' actress Park Ju-Hyun suffers a traffic accident; fans worry about her absence\n\nOscars 2026: ‘The Killers’, ‘Mimang’, ‘Hi-Five’ and more, 19 movies submitted for International Film Feature category\n\n'The Gilded Age' Season 3 Episode 6: Bertha shakes hand with Gladys; John Adams suffers unfortunate demise\n\nResident Alien concludes with season 4; cast reflects on series ending\n\nDid 'Love Island' stars JaNa Craig and Kenny Rodriguez break up? Fans notice sudden changes\n\nYunho's Journey: From K-Pop Superstar to Life Coach and Acclaimed Actor\n\nHan Ji-min's Minimalist Fashion Inspires Young Women to Embrace Sustainable Style\n\n'Reborn Rich' star Park Jihyun's reveals secret behind extreme 30 kg weight loss: 'Had to find an exercise I genuinely lo...\n\nWhen Korean Dramas open global doors: From 'Winter Sonata' to worldwide phenomenon\n\n'Sooyeon's Melody': No tears, only Grit--A brave girl's lonely family quest\n\nHa Ji-won's unedited photo goes VIRAL; fans refuse to believe she's 48: Pic\n\n5 stylish OTT shows every fashion enthusiast should watch\n\nJunior Edwards from ‘Swamp People’ passes away; know all about the legendary gator hunter - Report\n\nUpcoming week releases: Global stories you can’t miss\n\n‘Shark Tank India’ judge Aman Gupta on working with Gen Z: They are not the ones to say, ‘yes, sir;’ they question, ‘why,...\n\nPentagon's Yan An reveals doctors found benign brain tumour; to undergo surgery in August\n\n'Our Unwritten Seoul': Park Bo Young shares cute photos with Park Jinyoung; Fans can't keep calm\n\nYoon Kye-sang on upcoming sports film 'Try': 'I think rugby will become a popular sport through this drama'\n\nRoaring back: Kevin Woo finds new fame as the voice behind K-Pop Demon Hunters' Lion Boyz\n\nSong Young-kyu's drunk driving scandal rocks Korean entertainment industry; tip-off leads to arrest - Details Inside\n\nKevin Woo reacts to 'K-Pop Demon Hunters' success: 'I saw my old self in every frame'\n\nBilllie’s Haruna suffers violent break-in, spotlight on celebrity security\n\nMeet Annie: The billionaire heiress who picked K-Pop over power suits\n\nRoss and Rachel to Randall and Beth: Top 7 iconic US series couples and what they can teach us about love",
    "source": "Times of India",
    "date": null,
    "time": "16:37:33",
    "extracted_at": "2025-07-31T16:37:33.816434"
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/india-business/donald-trump-tariffs-news-live-updates-india-us-trade-deal-us-tariff-impact-august-1-deadline-russia-penalty-brics/liveblog/123011772.cms",
    "title": "Donald Trump Tariffs News Live Updates: US President says tariffs 'Making America great & rich again'  - The Times of India",
    "description": "'In less than a decade, India came out of 'Fragile Five' economies and it has now become the fastest-growing economy of the world. On the basis of the hardwork of reforms, farmers, MSMEs and industrialists, we have come in the top 5 economies of the world from the 11th largest economy. It is expected that we would be the third largest economy in a few years. Today, global institutions and economists see India as a bright spot in the global economy': Commerce minister Piyush Goyal in Lok Sabha",
    "full_content": "'In less than a decade, India came out of 'Fragile Five' economies and it has now become the fastest-growing economy of the world. On the basis of the hardwork of reforms, farmers, MSMEs and industrialists, we have come in the top 5 economies of the world from the 11th largest economy. It is expected that we would be the third largest economy in a few years. Today, global institutions and economists see India as a bright spot in the global economy': Commerce minister Piyush Goyal in Lok Sabha\n\n'Government is examining the impact of the recent events. Ministry of commerce and industry is holding talks with exporters, industries and all stakeholders and gathering information on their assessment of this issue. Government gives utmost priority to the safeguarding of welfare of farmers, labourers, entrepreneurs, industrialists, exporters, MSMEs and stakeholders of the industrial sector. We will take all necessary steps to safeguard our national interest': Commerce minister Piyush Goyal in Lok Sabha\n\n'In March 2025, India and the US started talks for a just, balanced and mutually beneficial Bilateral Trade Agreement (BTA). The goal of this was to finish the first stage of the Agreement by October-November 2025': Commerce minister Piyush Goyal in Lok Sabha\n\nDonald Trump says tariffs 'Making America great & rich again'\n\nIn a recent post on Truth Social, Donald Trump lauded the impact of tariffs, claiming they are \"making America GREAT & RICH Again.\" He asserted that these economic tools, previously used against the US, had a \"devastating impact\" on the nation's future and survival. Now, according to Trump, the \"tide has completely turned,\" and America has successfully countered this. He celebrated the nation's economic rebound, declaring that \"ONE YEAR AGO, AMERICA WAS A DEAD COUNTRY, NOW IT IS THE “HOTTEST”COUNTRY ANYWHERE IN THE WORLD.\" He concluded with \"CONGRATULATIONS TO ALL!\" on what he views as a major economic success.\n\n'India to take all steps to protect national interests': Commerce minister Piyush Goyal in Lok Sabha\n\n'Government examining implications of just announced 25 per cent US tariffs on Indian goods' : Commerce minister Piyush Goyal in Lok Sabha\n\nTrump Tariff News Live: Union minister of commerce and industry Piyush Goyal starts speaking in Lok Sabha on the reciprocal tariff imposed by the US\n\nTrump Tariff News Live: What the 25% levy means, who it affects, and what’s next\n\nUS President Donald Trump on Wednesday announced a fresh round of import tariffs on Indian goods, slapping a 25 per cent additional duties along with an unspecified penalty. The new duties, which come into effect on August 1, are being imposed in response to India’s ongoing high tariffs and purchases of crude oil and military hardware from Russia.The announcement has come despite ongoing trade talks between the two countries, catching many by surprise and triggering volatility in financial and export markets.\n\nTrump Tariff News Live: Major products in the trade between India and US\n\nIn 2024, trade between the US and India saw a diverse exchange of goods. India's top exports to the US included pharmaceuticals ($8.1 billion), telecom instruments ($6.5 billion), and precious stones ($5.3 billion). Petroleum products and vehicle components also featured prominently.Conversely, India imported significant amounts of crude oil ($4.5 billion), petroleum products ($3.6 billion), and coal ($3.4 billion) from the US. Other major imports included cut and polished diamonds, electric machinery, aircraft, and gold.\n\nMunjal Almoula, Head of tax, BDO India talks about US tariffs on India\n\n\"During ongoing negotiations for a trade deal between India and USA, the President of the United States has announced a 25% tariff on India (and an unspecified penalty). While the levy of additional tariff initially announced on 2nd April was deferred till 1st August to allow negotiation of trade deals with various countries, with this announcement, it is likely that the additional tariff would be imposed on exports from India, unless there is a last-minute extension of time for further negotiation,\" he said.The trade deal with USA, one of our biggest trading partners, involves navigating negotiations since there are various sensitive issues like GM crops, imports of dairy products etc., which are important for the Indian economy. Unless there is an agreement on safeguarding India’s interest on these issues as well as other similar issues such as bilateral agreement on digital services tax, stand for continuation for moratorium on customs duty on digital transmissions etc, such a deal may impact India's interests, and we would need to carefully assess the imperative of any such trade deal,\" he further added.\n\nTrump Tariff News Live: Pharma downplays 25% tariff impact, US healthcare could feel the blow instead of India- what sector experts say\n\nIndia’s pharmaceutical industry has responded strongly to Trump’s 25% tariff move, saying it will hurt US healthcare more than India. With India supplying nearly half of US generic drugs, experts warn of rising costs and shortages. They say India can pivot to other markets while the US scrambles for alternatives. Read full story\n\nIndia’s pharmaceutical industry has responded strongly to Trump’s 25% tariff move, saying it will hurt US healthcare more than India. With India supplying nearly half of US generic drugs, experts warn of rising costs and shortages. They say India can pivot to other markets while the US scrambles for alternatives.\n\nTrump Tariff News Live: Why India’s stock market has not crashed, is resilient even after 25% tariff announcement - explained\n\nIndian stock markets recovered from an initial decline on Thursday after US President Donald Trump announced the imposition of a 25% tariff and additional penalties on India. The Nifty50 and BSE Sensex opened with a gap down but rebounded, gaining over 700 points from the day’s lows.The tariff measures, set to take effect on August 1, position India as Trump’s primary focus in Asia, with the rates significantly higher than those imposed on Vietnam (20%), Indonesia, and the Philippines (19%) each. Market analysts attributed the swift recovery to investor confidence and expectations that the impact on key sectors would be manageable.Despite the severe tariff announcement, the Indian stock market did not experience a prolonged downturn, reflecting resilience amid geopolitical tensions. The government's response and potential negotiations with the US are likely factors contributing to the market's stabilization. Read full story\n\nIndian stock markets recovered from an initial decline on Thursday after US President Donald Trump announced the imposition of a 25% tariff and additional penalties on India. The Nifty50 and BSE Sensex opened with a gap down but rebounded, gaining over 700 points from the day’s lows.\n\nThe tariff measures, set to take effect on August 1, position India as Trump’s primary focus in Asia, with the rates significantly higher than those imposed on Vietnam (20%), Indonesia, and the Philippines (19%) each. Market analysts attributed the swift recovery to investor confidence and expectations that the impact on key sectors would be manageable.\n\nDespite the severe tariff announcement, the Indian stock market did not experience a prolonged downturn, reflecting resilience amid geopolitical tensions. The government's response and potential negotiations with the US are likely factors contributing to the market's stabilization.\n\nTariff News Live: Electronics sector gets 2-weeks reprieve from 25% Trump tariffs effective August 1- Here's why\n\nThe Indian electronics sector received a two-week reprieve from the proposed US tariffs, as a crucial category pertaining to technology products remained under review amidst ongoing bilateral discussions, according to govt and industry officials quoted by news agency PTI. US President Donald Trump announced on Wednesday a 25 per cent tariff on Indian imports effective August 1, alongside an additional, unspecified penalty linked to India’s continued purchases of Russian military equipment and oil. Read full story\n\nThe Indian electronics sector received a two-week reprieve from the proposed US tariffs, as a crucial category pertaining to technology products remained under review amidst ongoing bilateral discussions, according to govt and industry officials quoted by news agency PTI. US President Donald Trump announced on Wednesday a 25 per cent tariff on Indian imports effective August 1, alongside an additional, unspecified penalty linked to India’s continued purchases of Russian military equipment and oil.\n\nTrump Tariff News Live: Which sectors are at risk?\n\nDespite India's early engagement in trade talks with Washington after Prime Minister Narendra Modi's crucial White House visit in February, hopes for preferential treatment relative to neighbouring nations appear to have diminished. The current scenario shows Vietnam being subject to 20% tariffs, Indonesia at 19%, and Japan at 15%.We take a look at sectors with maximum exposure:\n\nDespite India's early engagement in trade talks with Washington after Prime Minister Narendra Modi's crucial White House visit in February, hopes for preferential treatment relative to neighbouring nations appear to have diminished. The current scenario shows Vietnam being subject to 20% tariffs, Indonesia at 19%, and Japan at 15%.\n\nTrump Tariff News Live: What’s the way forward?\n\n“It is worth noting that India runs an $38 bn trade surplus with the US (in 2024). 18% of India's overall export go to the US, valued at 2.1% of GDP ($81 bn in 2024). The main items India sells to the US are electronics, precious stones, pharmaceutical products, textiles, and machinery. The main items it buys from the US are mineral fuel, precious stones, machinery, and electronics.At these tariff rates, if the burden of higher tariffs is equally split between Indian producers and US consumers, it could directly shave off 0.3ppt from India's GDP growth. The penalty rate, if levied, would shave off further from growth, and there could be an indirect growth drag as well, led by lower capital inflows, investment.Another way to interpret today's announcement is to see it as a starting point for renewed negotiation. The Indian government's response on staying committed to the negotiations speak to that.As per news reports, the US-India trade deal had already reached advanced stages, but for some sticking points such as the US demanding access to sectors such as agriculture, dairy and genetically modified feed, which India was reluctant to give, given its large population dependent on agricultural income.Then there were some other sticking points such as trade in animal-based oils, and India's non-monetary trade barriers (import bans, licensing requirements, etc), which President Trump referred to as 'strenuous and obnoxious'Alongside some give-and-take in the sticking points discussed above, resolving the issue around oil purchases could guide the way forward,” says HSBC Global Investment Research.\n\nTariff News Live: Trump’s 25% tariff announcement\n\nHere is what Donald Trump posted on Truth Social:“Remember, while India is our friend, we have, over the years, done relatively little business with them because their Tariffs are far too high, among the highest in the World, and they have the most strenuous and obnoxious non-monetary Trade Barriers of any Country. Also, they have always bought a vast majority of their military equipment from Russia, and are Russia’s largest buyer of ENERGY, along with China, at a time when everyone wants Russia to STOP THE KILLING IN UKRAINE — ALL THINGS NOT GOOD! INDIA WILL THEREFORE BE PAYING A TARIFF OF 25%, PLUS A PENALTY FOR THE ABOVE, STARTING ON AUGUST FIRST. THANK YOU FOR YOUR ATTENTION TO THIS MATTER. MAGA!”\n\nTariff News Live: Trump wants India to buy oil from Pakistan\n\nUS President Donald Trump declared on Thursday that the US had reached an agreement with Pakistan for developing \"massive oil reserves\", additionally suggesting potential exports to India. This announcement follows Trump's implementation of 25% tariffs on India and his caution regarding further sanctions due to India's ongoing trade relations with Russia in defence equipment and crude oil.\"We have just concluded a Deal with the Country of Pakistan, whereby Pakistan and the United States will work together on developing their massive Oil Reserves,\" he posted on TruthSocial. He even suggested that in future India may buy oil from Pakistan.\"We are in the process of choosing the Oil Company that will lead this Partnership. Who knows, maybe they’ll be selling Oil to India some day!\" he added.\n\nTrump Tariff News Live: India’s first reaction\n\n“The Government has taken note of a statement by the US President on bilateral trade.  The Government is studying its implications.India and the US have been engaged in negotiations on concluding a fair, balanced and mutually beneficial bilateral trade agreement over the last few months. We remain committed to that objective.The Government attaches the utmost importance to protecting and promoting the welfare of our farmers, entrepreneurs, and MSMEs.The Government will take all steps necessary to secure our national interest, as has been the case with other trade agreements including the latest Comprehensive Economic and Trade Agreement with the UK,” the Ministry of Commerce & Industry read.\n\nTariff News Live: Negative development was anticipated\n\n“Given the escalating rhetoric around Russia-Ukraine negotiations, some form of adverse development was anticipated. However, the fine print of this announcement remains crucially important—the specifics of the additional ‘penalty’ beyond the 25% tariff may determine the actual economic impact.Two fundamental aspects merit emphasis. First, in today’s rapidly evolving global scenario, policy positions are rarely final. Second, markets consistently demonstrate remarkable adaptive capacity—even under adverse conditions, economic actors innovate and new equilibria emerge.Finally, sustaining the growth momentum will ultimately depend on the ability to innovate while deepening economic partnerships across the global landscape. The current situation reinforces the wisdom of our multi-alignment approach in an increasingly multipolar world order,” says Rishi Shah, Partner and Economic Advisory Services Leader, Grant Thornton Bharat.\n\nDonald Trump Tariffs: Rates For Different Countries - Where Does India Stand?\n\nTariff News Live: Rs 5 lakh crore lost in just 15 minutes! Nifty50, BSE Sensex recover from lows - top reasons for fall\n\nNifty50 and BSE Sensex, the Indian equity benchmark indices, sharply dropped in trade after US President Trump announced a 25% tariff plus additional penalty on India. While Nifty50 went below 24,700, BSE Sensex was down 600 points intraday. At 11:01 AM, Nifty50 was trading at 24,725.40, down 130 points or 0.52%. BSE Sensex was at 81,034.50, down 447 points or 0.55%. Read full story\n\nNifty50 and BSE Sensex, the Indian equity benchmark indices, sharply dropped in trade after US President Trump announced a 25% tariff plus additional penalty on India. While Nifty50 went below 24,700, BSE Sensex was down 600 points intraday. At 11:01 AM, Nifty50 was trading at 24,725.40, down 130 points or 0.52%. BSE Sensex was at 81,034.50, down 447 points or 0.55%.\n\nTrump Tariff News Live: 'Busy day' at White House with 25% tariff on India; 'dead economies' jibe, trade deal with Pak & more – Key points\n\nIt was a \"busy day\" at the White House on Wednesday as President Donald Trump rolled out a series of key announcements, including a 25% tariff and additional penalties on Indian goods, despite repeatedly calling India and Prime Minister Narendra Modi \"friends.\" At the same time, he offered to assist India's hostile neighbour Pakistan in developing its \"massive oil reserves,\" even suggesting that Pakistan might export oil to India in the future. Later, Trump escalated his tone, remarking that India and Russia could \"take their dead economies down together.\" Read full story\n\nIt was a \"busy day\" at the White House on Wednesday as President Donald Trump rolled out a series of key announcements, including a 25% tariff and additional penalties on Indian goods, despite repeatedly calling India and Prime Minister Narendra Modi \"friends.\" At the same time, he offered to assist India's hostile neighbour Pakistan in developing its \"massive oil reserves,\" even suggesting that Pakistan might export oil to India in the future. Later, Trump escalated his tone, remarking that India and Russia could \"take their dead economies down together.\"\n\nTrump tariff impact on stock market: Sensex down 500 points\n\nSock market opened at a low with Nifty50 and BSE Sensex, the Indian equity benchmark indices, dropping sharply after US President Trump announced 25% tariff plus additional penalty on India. Read full story\n\nSock market opened at a low with Nifty50 and BSE Sensex, the Indian equity benchmark indices, dropping sharply after US President Trump announced 25% tariff plus additional penalty on India.\n\nTariff News Live: Feroze Azeez, Joint CEO, Anand Rathi Wealth Limited gives insight on US' 25% tariffs\n\n\"The announcement of a 25% tariff on Indian goods, while higher than anticipated, broadly falls within the 15–20% range that markets had been bracing for. In that sense, it is not entirely unexpected. What requires close monitoring is the structure of the additional penalty linked to arms and energy imports from Russia, which remains undefined at this stage. From a technical standpoint, this move could weigh on near-term export competitiveness and trigger currency volatility if sentiment deteriorates. That said, the overall trade and investment relationship between India and the U.S. still has room for improvement and is not yet in a worrisome zone. The Indian market is currently being driven largely by domestic investors, and FIIs are almost 85% short. Therefore, a major sell-off is not expected. Some volatility is likely, any dips wil be buying opportunities for investors with even 2-3 year time frames as we have already had a 10 month time correction,\" he said.\n\nTrump Tariff News Live: Aditi Raman, Associate Economist, Moody's Analytics speaks on impact of US tariffs\n\n\"The US has announced a 25% tariff on Indian exports, down just one percentage point from what was announced in April, plus potential secondary sanctions for importing Russian oil. While the US is India's largest trade partner, the Indian economy is relatively more domestically oriented than most of the region and relies far less on trade. Pharmaceuticals, gems, and textiles are key sectors that are likely to be hit. A point of contention is market access to the key agricultural and dairy sector, which India has historically been reluctant to grant,\" she said.\n\nIndia caught in US-Iran crossfire: Trump administation orders sanctions against 6 companies over oil trade; $220 million worth of deals under scanner\n\nThe US has sanctioned six Indian companies for allegedly engaging in significant petroleum and petrochemical trade with Iran, in violation of American sanctions. The firms include Alchemical Solutions, Global Industrial Chemicals, Jupiter Dye Chem, Ramniklal S Gosalia and Company, Persistent Petrochem, and Kanchan Polymers.Alchemical Solutions faces the largest allegation, with imports of Iranian petrochemical goods worth over $84 million in 2024. The sanctions freeze any US-linked assets and prohibit American entities from conducting business with these firms. The action is part of a broader enforcement against 20 global entities under the US's \"maximum pressure\" strategy on Iran.Companies may appeal their designation to the US Treasury’s Office of Foreign Assets Control. Read full story\n\nThe US has sanctioned six Indian companies for allegedly engaging in significant petroleum and petrochemical trade with Iran, in violation of American sanctions.\n\nThe firms include Alchemical Solutions, Global Industrial Chemicals, Jupiter Dye Chem, Ramniklal S Gosalia and Company, Persistent Petrochem, and Kanchan Polymers.\n\nAlchemical Solutions faces the largest allegation, with imports of Iranian petrochemical goods worth over $84 million in 2024. The sanctions freeze any US-linked assets and prohibit American entities from conducting business with these firms. The action is part of a broader enforcement against 20 global entities under the US's \"maximum pressure\" strategy on Iran.\n\nCompanies may appeal their designation to the US Treasury’s Office of Foreign Assets Control.\n\n‘India and Russia can drag their dead economies down together’ says Trump; gives warning to Ex-Russian President\n\nUS President Donald Trump criticised India and Russia on Thursday, suggesting that the two nations could \"take their dead economies down together.\" In a post on Truth Social, Trump stated, \"I don’t care what India does with Russia. They can take their dead economies down together, for all I care. We have done very little business with India — their tariffs are too high, among the highest in the world. Likewise, Russia and the USA do almost no business together.\" Read full story\n\nUS President Donald Trump criticised India and Russia on Thursday, suggesting that the two nations could \"take their dead economies down together.\" In a post on Truth Social, Trump stated, \"I don’t care what India does with Russia. They can take their dead economies down together, for all I care. We have done very little business with India — their tariffs are too high, among the highest in the world. Likewise, Russia and the USA do almost no business together.\"",
    "source": "Times of India",
    "date": "2025-07-31",
    "time": "00:00:00",
    "extracted_at": "2025-07-31T16:37:35.244581"
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/india-business/india-set-to-be-third-largest-economy-piyush-goyal-responds-to-donald-trumps-dead-economy-jibe-reiterates-national-interest-important/articleshow/123017871.cms",
    "title": "'India set to be third largest economy', says Piyush Goyal after Donald Trump's 'dead economy' jibe; reiterates national interest important - Times of India",
    "description": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insight...",
    "full_content": "The TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More\n\n8 rare and elusive animal species of India!\n\nSanam Shetty dazzles in chic sarees\n\nBaby names inspired by Lord Ganesh for your little one\n\nHow was life like in Shakespare's time: Here are 10 facts\n\nThrowback pictures of Sridevi with her family\n\nHow to make rice water rinse for quick hair growth\n\nStunning & stylish! Preity Mukundhan’s picture-perfect frames\n\n9 best foods to relieve constipation\n\nRupali Ganguly’s top 10 festive ethnic looks\n\n10 things to know before getting a Pug puppy home\n\nDetermine the monthly installment amount for a loan\n\nEstimate the returns on investments made through SIPs\n\nFind out maturity amount and interest earned on PPF\n\nCheck maturity amount and interest earned on an FD\n\nEstimate the pension amount and corpus accumulated under NPS\n\nA Mutual Fund Calculator helps estimate the future value of investments",
    "source": "Times of India",
    "date": "2025-07-31",
    "time": "16:37:36",
    "extracted_at": "2025-07-31T16:37:36.750580"
  },
  {
    "url": "https://www.bbc.com/news",
    "title": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world",
    "description": "The US special envoy to the Middle East is in Israel today, after Canada joined the UK and France in planning to recognise Palestine.",
    "full_content": "Trump says Canada's move to recognise Palestinian state threatens trade deal\n\nThe US special envoy to the Middle East is in Israel today, after Canada joined the UK and France in planning to recognise Palestine.\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIsrael's military says fired \"warning shots\" as crowds gathered around aid lorries but was \"not aware of any casualties\" from its fire.\n\nWhy Australians celebrate Christmas twice a year\n\nThe Australian tradition was born in the 1980s after a group of Irishmen became homesick for a winter Christmas.\n\nWhat screen time does to children's brains is more complicated than it seems\n\nScreen time has become synonymous with bad news - but the science may not be as straightforward as it seems\n\nIndia court acquits seven accused in 2008 Malegaon blast case\n\nSix people were killed and nearly a hundred injured in the attack 17 years ago.\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIsrael's military says fired \"warning shots\" as crowds gathered around aid lorries but was \"not aware of any casualties\" from its fire.\n\nTrump's tariffs could deal a blow to India's growth and exports\n\nThe effect on India's GDP is unclear as Trump announced an unspecified penalty in addition to 25% tariffs.\n\nTrump announces deal to impose 15% tariff on South Korea\n\nThe agreement comes just a day before a 1 August deadline for countries to strike deals with the US.\n\nSotheby's returns Buddha jewels to India after uproar\n\nThe Piprahwa Gems were due to be auctioned in May, but the sale was called off after diplomatic intervention.\n\nWhy Australians celebrate Christmas twice a year\n\nThe Australian tradition was born in the 1980s after a group of Irishmen became homesick for a winter Christmas.\n\nRussian strikes kill eight and hit Kyiv apartment block, officials say\n\nAustralian childcare worker charged with creating abuse videos\n\nVerifying drone and missile strikes in Ukraine\n\n'Communities' of strange, extreme life seen for first time in deep ocean\n\nTrump sanctions judge in Bolsonaro coup case and hits Brazil with 50% tariffs\n\nMore to explore\n\nFinger painting by artist with nerve injury wins Australian art award\n\n\"Without a brush, painting was almost painless,\" said Filipina-Australian artist Loribelle Spirovski.\n\nSongs are getting longer again, despite TikTok - but why?\n\nAid cuts will push Nigerians into arms of Boko Haram militants, UN warns\n\nThe end of food aid could have devastating effects for the victims of an Islamist insurgency.\n\nFirst Australian-made rocket crashes shortly after lift-off\n\nThe company behind the country's first orbital rocket called the launch a 'giant leap' despite crashing after only 14 seconds.\n\nOlympic star Dahlmeier dead after climbing accident\n\nTwo-time Olympic champion Laura Dahlmeier dies aged 31 after a mountaineering accident in Pakistan.\n\nSongs are getting longer again, despite TikTok - but why?\n\nWednesday fame was overwhelming, says Jenna Ortega\n\nThe 22-year-old said she didn't know if anyone would watch the Netflix series about Wednesday Addams.\n\nBritish 999 call handler's voice cloned by Russian network using AI\n\nA BBC Verify investigation has revealed that the identities of British public sector workers have been cloned using AI by a Russian-linked disinformation campaign.\n\nAid cuts will push Nigerians into arms of Boko Haram militants, UN warns\n\nThe end of food aid could have devastating effects for the victims of an Islamist insurgency.\n\nMost watched\n\nFirst Australian-made rocket crashes shortly after lift-off\n\nBritish 999 call handler's voice cloned by Russian network using AI\n\nWatch: Fighter jet swerves dramatically to avoid birds near packed beach\n\nSharon Osbourne and family look at Ozzy tributes in Birmingham\n\nWatch: Bus in flames in central London\n\nAlso in news\n\nHotel tycoon reveals Heathrow expansion proposal\n\nArora Group says a shorter runway will avoid the cost and disruption of diverting the M25 motorway.\n\nFed holds US interest rates steady despite Trump pressure\n\nBut support for a cut may be widening, as debates rage about how tariffs will affect the US economy.\n\nKamala Harris rules out running for California governor\n\n\"For now, my leadership - and public service - will not be in elected office,\" the former vice-president said in a statement.\n\nAustralian childcare worker charged with creating abuse videos\n\nAustralia is facing a reckoning over safety within its childcare sector, after a series of abuse cases.\n\nFrance-Spain flight row over Jewish teens escalates\n\nAurore Bergé and Benjamin Haddad condemn remarks by Spain's transport minister as a diplomatic spat continues.\n\nFed holds US interest rates steady despite Trump pressure\n\nBut support for a cut may be widening, as debates rage about how tariffs will affect the US economy.\n\nFrance-Spain flight row over Jewish teens escalates\n\nAurore Bergé and Benjamin Haddad condemn remarks by Spain's transport minister as a diplomatic spat continues.\n\nWhat screen time does to children's brains is more complicated than it seems\n\nTrump's tariffs could deal a blow to India's growth and exports\n\n'Communities' of strange, extreme life seen for first time in deep ocean\n\nSotheby's returns Buddha jewels to India after uproar\n\nFamily and fans give Ozzy Osbourne emotional send-off\n\nAustralian childcare worker charged with creating abuse videos\n\nWhy Australians celebrate Christmas twice a year\n\nHow Trump's tariffs are already impacting Americans\n\nWhat does recognising a Palestinian state mean?\n\nDozens killed seeking food in Gaza, hospital says, as US envoy arrives in Israel\n\nIndia rebuild after early Atkinson wicket in fifth Test at The Oval\n\nFollow live text, radio commentary and in-play video clips as England face India in the fifth Test at The Oval.\n\nWomen's Open: Hull one shot off lead after string of birdies\n\nFollow coverage of the first round of the AIG Women's Open at Royal Porthcawl in Wales.\n\nBrady queries Rooney's 'work ethic' at Birmingham\n\nBirmingham City minority owner Tom Brady questions former Blues manager Wayne Rooney's work ethic in a new Amazon Prime documentary series.\n\nKinghorn and Ryan in for final Lions Test\n\nBritish and Irish Lions coach Andy Farrell makes two changes for the final Test against the Wallabies in Sydney on Saturday.\n\nCounty Championship: Nine games as Surrey push for victory\n\nFollow live text and listen to BBC local radio commentaries from day three of the 11th round of the 2025 County Championship.\n\nWomen's Open: Hull one shot off lead after string of birdies\n\nFollow coverage of the first round of the AIG Women's Open at Royal Porthcawl in Wales.\n\nTransfer news: Latest on Sesko, Hato plus pre-season updates\n\nAll the latest transfer news as Man Utd target Leipzig striker Benjamin Sesko and Chelsea agree a deal forAjax defender Jorrel Hato.\n\n'I'd be lost without football' - the ex-Premier League striker playing at 49\n\nAs he approaches his 50th birthday, ex-Premier League striker Jamie Cureton tells BBC Sport why he is not ready to quit playing yet.\n\nBrady queries Rooney's 'work ethic' at Birmingham\n\nBirmingham City minority owner Tom Brady questions former Blues manager Wayne Rooney's work ethic in a new Amazon Prime documentary series.",
    "source": "bbc.com",
    "date": "2025-07-31",
    "time": "16:37:38",
    "extracted_at": "2025-07-31T16:37:38.416092"
  }
]