[
  {
    "source": "BBC",
    "title": "Trump threatens to impose additional 100% tariff on China",
    "date": "2025-10-10",
    "time": "22:38:14",
    "content": "US President Donald Trump has said he would impose an additional 100% tariff on imports from China from next month. In a post on social media, Trump said the US would also put export controls on critical software. In an earlier post on Friday, he hit back at Beijing's move this week to tighten its rules for exports of rare earths, accusing China of \"becoming very hostile\" and trying to hold the world \"captive\". He threatened to pull out of a meeting with China's President Xi Jinping. He later said he had not cancelled it, but that he did not know \"that we're going to have it\". \"I'm going to be there regardless,\" he told reporters at the White House. Financial markets dropped in the wake of Trump's remarks, with the S&P 500 closing down 2.7%, its steepest fall since April. China dominates production of rare earths and certain other key materials, which are key components in cars, smartphones and many other items. The last time Beijing tightened export controls - after Trump raised tariffs on Chinese goods early this year - there was an outcry from many US firms reliant on the materials. Carmaker Ford even had to temporarily pause production. In addition to tightening rules for rare earth exports, China has opened a monopoly investigation into the US tech firm Qualcomm that could stall its acquisition of another chipmaker. Although Qualcomm is based in the US, a significant portion of its business is concentrated in China. Beijing has also said it will charge new port fees to ships with ties to the US, including those owned or operated by US firms. \"Some very strange things are happening in China!\" Trump wrote in a post on social media on Friday. \"They are becoming very hostile.\" The US and China have been in a fragile trade détente since May, when the two sides agreed to drop triple-digit tariffs on each others' goods that had nearly stopped trade between the two countries. The move left US tariffs on Chinese goods facing an added 30% levy compared with the start of the year, while US goods entering China face a new 10% tariff. Officials have held a series of talks since then on matters including TikTok, agricultural purchases, and the trade of rare earths and advanced technology like semiconductors. The two sides were expected to meet again this month at a summit in South Korea. China expert Jonathan Czin, a fellow at the Brookings Institution, said Xi's recent actions were a bid to shape the upcoming talks, noting that the recent rare earths directive does not go into effect immediately. \"He's looking for ways to seize the initiative,\" he said. \"The Trump administration is having to play a game of whack-a-mole and deal with these issues as they come up.\" He added that he did not think China was worried about US retaliation in response. \"What China took away from the Liberation Day tariffs and the cycle of escalation followed by de-escalation is that the Chinese side had a higher pain threshold,\" he said. \"From their perspective, the Trump administration blinked.\" In prior rounds of trade talks, China has pushed for looser US restrictions on semiconductors. It is also interested in securing more stable tariff policiesthat would make it easier for its businesses to sell into the US. Xi had previously used as leverage his country's dominance of rare earths production. But the export rules unveiled this week target overseas defence manufacturers, making them particularly serious, said Gracelin Baskaran, director of the critical minerals security program at Washington-based Center for Strategic and International Studies. \"Nothing makes America move like targeting our defence industry,\" she said. \"The US is going to have to negotiate because we have limited options, and in an era of rising geopolitical tension and potential conflict, we need to build our industrial defence base.\" While a Trump-Xi meeting now looks unlikely, she said it was not necessarily completely off the table.Ms Baskaran said there's still time and room for talks. China's new rules don't take effect until December. \"Negotiations are likely imminent,\" she said. \"Who does them and where they happen will be determined with time.\"",
    "url": "https://www.bbc.com/news/articles/cn4wkd7729po"
  },
  {
    "source": "IndianExpress",
    "title": "US-China trade war escalates as Trump announces 100% additional tariff on Chinese imports",
    "date": "2025-10-11",
    "time": "07:26:13",
    "content": "US-China Tariff war:US President Donald Trump on Friday announced a new round of trade measures targeting China, announcing plans to levy an additional 100 per cent tariff on all Chinese imports and introduce strict export controls on US-made critical software starting November 1. The move is expected to heighten trade tensions between the world’s two largest economies. Posting on Truth Social, Trump accused Beijing of taking an “extraordinarily aggressive” stance on trade and warned that the US would respond firmly. “Starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying. Also on November 1st, we will impose Export Controls on any and all critical software,” Trump said. He said the decision was prompted by reports that China intends to impose wide-ranging export restrictions on nearly all its products, describing the move as “a moral disgrace” in its dealings with other countries. “It has just been learned that China has taken an extraordinarily aggressive position on Trade in sending an extremely hostile letter to the World, stating that they were going to, effective November 1st, 2025, impose large scale Export Controls on virtually every product they make, and some not even made by them. This affects ALL Countries, without exception, and was obviously a plan devised by them years ago. It is absolutely unheard of in International Trade, and a moral disgrace in dealing with other Nations.” Trump further stated that the US would implement export controls on all critical software starting November 1, asserting that this measure applied solely to American policy and not to other nations facing similar threats. In a separate post earlier, Trump threatened to cancel his scheduled meeting with Chinese president Xi Jinping. “I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems to be no reason to do so,” he said. He said: “They [China] are becoming very hostile, and sending letters to countries throughout the World, that they want to impose Export Controls on each and every element of production having to do with Rare Earths, and virtually anything else they can think of, even if it’s not manufactured in China.” Trump also said that things were no longer “routine at all” and that he had not spoken to President Xi because “there was no reason to do so”.",
    "url": "https://indianexpress.com/article/world/us-china-trade-war-escalates-trump-imposes-100-per-cent-tariff-on-chinese-imports-10300336/?ref=breaking_hp"
  }
]